#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DemonHunter_Crossbow_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_DemonHunter_Crossbow_Athena.B_DemonHunter_Crossbow_Athena_C.ExecuteUbergraph_B_DemonHunter_Crossbow_Athena
// 0x0018 (0x0018 - 0x0000)
struct B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMagazineAmmoCount_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_Event_SpawnProjectile;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena) == 0x000008, "Wrong alignment on B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena");
static_assert(sizeof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena) == 0x000018, "Wrong size on B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, EntryPoint) == 0x000000, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, K2Node_Event_ReloadStage) == 0x000004, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, CallFunc_GetMagazineAmmoCount_ReturnValue) == 0x000008, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::CallFunc_GetMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, CallFunc_IsActive_ReturnValue) == 0x00000D, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena, K2Node_Event_SpawnProjectile) == 0x000010, "Member 'B_DemonHunter_Crossbow_Athena_C_ExecuteUbergraph_B_DemonHunter_Crossbow_Athena::K2Node_Event_SpawnProjectile' has a wrong offset!");

// Function B_DemonHunter_Crossbow_Athena.B_DemonHunter_Crossbow_Athena_C.OnPlayReloadFX
// 0x0001 (0x0001 - 0x0000)
struct B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX final
{
public:
	EFortReloadFXState                            ReloadStage;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX) == 0x000001, "Wrong alignment on B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX");
static_assert(sizeof(B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX) == 0x000001, "Wrong size on B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX, ReloadStage) == 0x000000, "Member 'B_DemonHunter_Crossbow_Athena_C_OnPlayReloadFX::ReloadStage' has a wrong offset!");

// Function B_DemonHunter_Crossbow_Athena.B_DemonHunter_Crossbow_Athena_C.OnSpawnProjectile
// 0x0008 (0x0008 - 0x0000)
struct B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile) == 0x000008, "Wrong alignment on B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile");
static_assert(sizeof(B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile) == 0x000008, "Wrong size on B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile");
static_assert(offsetof(B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile, SpawnProjectile) == 0x000000, "Member 'B_DemonHunter_Crossbow_Athena_C_OnSpawnProjectile::SpawnProjectile' has a wrong offset!");

}

