#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HookGunRope

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HookGunRope.B_HookGunRope_C
// 0x00C0 (0x03F0 - 0x0330)
class AB_HookGunRope_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Grappling_Hook_Projectile;                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rope;                                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Tight_NewTrack_0_FFAA67BE44D4D10C00414E828FA9423F; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Tight__Direction_FFAA67BE44D4D10C00414E828FA9423F; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Tight;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Reel_In_Tighten_22145CB34BE582F3E6C3B88B44E066FE;  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Reel_In_Reel_Lerp_Controller_22145CB34BE582F3E6C3B88B44E066FE; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Reel_In__Direction_22145CB34BE582F3E6C3B88B44E066FE; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Reel_In;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start_Rope;                                        // 0x0378(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End_Rope;                                          // 0x0384(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Projectile_Gone;                                   // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Prj_Hook_Athena_C*                   Projectile_Actor;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            RopeGE;                                            // 0x03A8(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USoundBase*                             ReelSound;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReattachSound;                                     // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RopeActiveTag;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BlockIncomingPickups;                              // 0x03C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Change_Equipment_Tag;                              // 0x03D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_HookGunRope(int32 EntryPoint);
	void TightenRope();
	void ReceiveTick(float DeltaSeconds);
	void End_Reel();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Reel_In__FinishedFunc();
	void Reel_In__UpdateFunc();
	void Set_Start_Point_of_Rope();
	void Tight__FinishedFunc();
	void Tight__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HookGunRope_C">();
	}
	static class AB_HookGunRope_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HookGunRope_C>();
	}
};
static_assert(alignof(AB_HookGunRope_C) == 0x000008, "Wrong alignment on AB_HookGunRope_C");
static_assert(sizeof(AB_HookGunRope_C) == 0x0003F0, "Wrong size on AB_HookGunRope_C");
static_assert(offsetof(AB_HookGunRope_C, UberGraphFrame) == 0x000330, "Member 'AB_HookGunRope_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, SM_Grappling_Hook_Projectile) == 0x000338, "Member 'AB_HookGunRope_C::SM_Grappling_Hook_Projectile' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Rope) == 0x000340, "Member 'AB_HookGunRope_C::Rope' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, DefaultSceneRoot) == 0x000348, "Member 'AB_HookGunRope_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Tight_NewTrack_0_FFAA67BE44D4D10C00414E828FA9423F) == 0x000350, "Member 'AB_HookGunRope_C::Tight_NewTrack_0_FFAA67BE44D4D10C00414E828FA9423F' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Tight__Direction_FFAA67BE44D4D10C00414E828FA9423F) == 0x000354, "Member 'AB_HookGunRope_C::Tight__Direction_FFAA67BE44D4D10C00414E828FA9423F' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Tight) == 0x000358, "Member 'AB_HookGunRope_C::Tight' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Reel_In_Tighten_22145CB34BE582F3E6C3B88B44E066FE) == 0x000360, "Member 'AB_HookGunRope_C::Reel_In_Tighten_22145CB34BE582F3E6C3B88B44E066FE' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Reel_In_Reel_Lerp_Controller_22145CB34BE582F3E6C3B88B44E066FE) == 0x000364, "Member 'AB_HookGunRope_C::Reel_In_Reel_Lerp_Controller_22145CB34BE582F3E6C3B88B44E066FE' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Reel_In__Direction_22145CB34BE582F3E6C3B88B44E066FE) == 0x000368, "Member 'AB_HookGunRope_C::Reel_In__Direction_22145CB34BE582F3E6C3B88B44E066FE' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Reel_In) == 0x000370, "Member 'AB_HookGunRope_C::Reel_In' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Start_Rope) == 0x000378, "Member 'AB_HookGunRope_C::Start_Rope' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, End_Rope) == 0x000384, "Member 'AB_HookGunRope_C::End_Rope' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Projectile_Gone) == 0x000390, "Member 'AB_HookGunRope_C::Projectile_Gone' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Projectile_Actor) == 0x000398, "Member 'AB_HookGunRope_C::Projectile_Actor' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, PlayerPawn) == 0x0003A0, "Member 'AB_HookGunRope_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, RopeGE) == 0x0003A8, "Member 'AB_HookGunRope_C::RopeGE' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, ReelSound) == 0x0003B0, "Member 'AB_HookGunRope_C::ReelSound' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, ReattachSound) == 0x0003B8, "Member 'AB_HookGunRope_C::ReattachSound' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, RopeActiveTag) == 0x0003C0, "Member 'AB_HookGunRope_C::RopeActiveTag' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, BlockIncomingPickups) == 0x0003C8, "Member 'AB_HookGunRope_C::BlockIncomingPickups' has a wrong offset!");
static_assert(offsetof(AB_HookGunRope_C, Change_Equipment_Tag) == 0x0003D0, "Member 'AB_HookGunRope_C::Change_Equipment_Tag' has a wrong offset!");

}

