#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Minigun_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Minigun_Athena.B_Minigun_Athena_C.ExecuteUbergraph_B_Minigun_Athena
// 0x05A0 (0x05A0 - 0x0000)
struct B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0008(0x0558)()
	class UMaterialInstanceDynamic*               K2Node_Event_DynamicMaterialInstance;              // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x056D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56E[0x2];                                      // 0x056E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CurrentScalarValue_ReturnValue;           // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0578(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_CurrentScalarValue_ReturnValue1;          // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0590(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena) == 0x000008, "Wrong alignment on B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena");
static_assert(sizeof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena) == 0x0005A0, "Wrong size on B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, EntryPoint) == 0x000000, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_bPersistentFire) == 0x000005, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_bSecondaryFire) == 0x000006, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_CosmeticMod) == 0x000008, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_DynamicMaterialInstance) == 0x000560, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_DynamicMaterialInstance' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000568, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsDedicatedServer_ReturnValue1) == 0x00056C, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00056D, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_CurrentScalarValue_ReturnValue) == 0x000570, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_CurrentScalarValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_Lerp_ReturnValue) == 0x000574, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000578, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_CurrentScalarValue_ReturnValue1) == 0x000588, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_CurrentScalarValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000590, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000598, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsPlaying_ReturnValue) == 0x000599, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.OnInitCosmeticAlterations
// 0x0560 (0x0560 - 0x0000)
struct B_Minigun_Athena_C_OnInitCosmeticAlterations final
{
public:
	struct FFortCosmeticModification              CosmeticMod;                                       // 0x0000(0x0558)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Minigun_Athena_C_OnInitCosmeticAlterations) == 0x000008, "Wrong alignment on B_Minigun_Athena_C_OnInitCosmeticAlterations");
static_assert(sizeof(B_Minigun_Athena_C_OnInitCosmeticAlterations) == 0x000560, "Wrong size on B_Minigun_Athena_C_OnInitCosmeticAlterations");
static_assert(offsetof(B_Minigun_Athena_C_OnInitCosmeticAlterations, CosmeticMod) == 0x000000, "Member 'B_Minigun_Athena_C_OnInitCosmeticAlterations::CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_OnInitCosmeticAlterations, DynamicMaterialInstance) == 0x000558, "Member 'B_Minigun_Athena_C_OnInitCosmeticAlterations::DynamicMaterialInstance' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Minigun_Athena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Minigun_Athena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Minigun_Athena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Minigun_Athena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Minigun_Athena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Minigun_Athena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Minigun_Athena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Minigun_Athena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct B_Minigun_Athena_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Minigun_Athena_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_Minigun_Athena_C_UserConstructionScript");
static_assert(sizeof(B_Minigun_Athena_C_UserConstructionScript) == 0x000010, "Wrong size on B_Minigun_Athena_C_UserConstructionScript");
static_assert(offsetof(B_Minigun_Athena_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Minigun_Athena_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'B_Minigun_Athena_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.CurrentScalarValue
// 0x0010 (0x0010 - 0x0000)
struct B_Minigun_Athena_C_CurrentScalarValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverheatingMaxValue_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentOverheatValue_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Minigun_Athena_C_CurrentScalarValue) == 0x000004, "Wrong alignment on B_Minigun_Athena_C_CurrentScalarValue");
static_assert(sizeof(B_Minigun_Athena_C_CurrentScalarValue) == 0x000010, "Wrong size on B_Minigun_Athena_C_CurrentScalarValue");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, ReturnValue) == 0x000000, "Member 'B_Minigun_Athena_C_CurrentScalarValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, CallFunc_GetOverheatingMaxValue_ReturnValue) == 0x000004, "Member 'B_Minigun_Athena_C_CurrentScalarValue::CallFunc_GetOverheatingMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, CallFunc_GetCurrentOverheatValue_ReturnValue) == 0x000008, "Member 'B_Minigun_Athena_C_CurrentScalarValue::CallFunc_GetCurrentOverheatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'B_Minigun_Athena_C_CurrentScalarValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

