#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_KnockGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_KnockGrenade.B_Prj_Athena_KnockGrenade_C
// 0x00C0 (0x0858 - 0x0798)
class AB_Prj_Athena_KnockGrenade_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0798(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        BeepTimer;                                         // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Fuse_Particle;                                     // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        GrenadeFuse_AudioComponent;                        // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Distance;                                   // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Explosion;                                       // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_DistantSound;                                  // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_GrenadeFuseSound;                              // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x07F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VerticalPop;                                       // 0x07FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Target;                                            // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x0808(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             BeepSound;                                         // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0820(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeExplode;                                // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     VehicleTarget;                                     // 0x0830(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VehicleZ_Impulse;                                  // 0x0838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VehicleRadialImpulse;                              // 0x083C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StuckVehicle;                                      // 0x0840(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_841[0x3];                                      // 0x0841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x0844(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnemyPawn_Parent_C*                    DeimosPawn;                                        // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WeaponImpact;                                      // 0x0850(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_KnockGrenade(int32 EntryPoint);
	void BndEvt__ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void LaunchDeimos();
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void Stop_Rotation();
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Handle_Pawn_Detach_RC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_KnockGrenade_C">();
	}
	static class AB_Prj_Athena_KnockGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_KnockGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_KnockGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_KnockGrenade_C");
static_assert(sizeof(AB_Prj_Athena_KnockGrenade_C) == 0x000858, "Wrong size on AB_Prj_Athena_KnockGrenade_C");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, UberGraphFrame) == 0x000798, "Member 'AB_Prj_Athena_KnockGrenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, BeepTimer) == 0x0007A0, "Member 'AB_Prj_Athena_KnockGrenade_C::BeepTimer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, RotatingMovement) == 0x0007A8, "Member 'AB_Prj_Athena_KnockGrenade_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Fuse_Particle) == 0x0007B0, "Member 'AB_Prj_Athena_KnockGrenade_C::Fuse_Particle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Mesh) == 0x0007B8, "Member 'AB_Prj_Athena_KnockGrenade_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, GrenadeFuse_AudioComponent) == 0x0007C0, "Member 'AB_Prj_Athena_KnockGrenade_C::GrenadeFuse_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Effect_Distance) == 0x0007C8, "Member 'AB_Prj_Athena_KnockGrenade_C::Effect_Distance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, P_Explosion) == 0x0007D0, "Member 'AB_Prj_Athena_KnockGrenade_C::P_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Cue_DistantSound) == 0x0007D8, "Member 'AB_Prj_Athena_KnockGrenade_C::Cue_DistantSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Cue_CloseSound) == 0x0007E0, "Member 'AB_Prj_Athena_KnockGrenade_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Cue_GrenadeFuseSound) == 0x0007E8, "Member 'AB_Prj_Athena_KnockGrenade_C::Cue_GrenadeFuseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, HitLocation) == 0x0007F0, "Member 'AB_Prj_Athena_KnockGrenade_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, VerticalPop) == 0x0007FC, "Member 'AB_Prj_Athena_KnockGrenade_C::VerticalPop' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Target) == 0x000800, "Member 'AB_Prj_Athena_KnockGrenade_C::Target' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, ImpactNormal) == 0x000808, "Member 'AB_Prj_Athena_KnockGrenade_C::ImpactNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, BeepSound) == 0x000818, "Member 'AB_Prj_Athena_KnockGrenade_C::BeepSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, HitNormal) == 0x000820, "Member 'AB_Prj_Athena_KnockGrenade_C::HitNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, DelayBeforeExplode) == 0x00082C, "Member 'AB_Prj_Athena_KnockGrenade_C::DelayBeforeExplode' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, VehicleTarget) == 0x000830, "Member 'AB_Prj_Athena_KnockGrenade_C::VehicleTarget' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, VehicleZ_Impulse) == 0x000838, "Member 'AB_Prj_Athena_KnockGrenade_C::VehicleZ_Impulse' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, VehicleRadialImpulse) == 0x00083C, "Member 'AB_Prj_Athena_KnockGrenade_C::VehicleRadialImpulse' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, StuckVehicle) == 0x000840, "Member 'AB_Prj_Athena_KnockGrenade_C::StuckVehicle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, Radius) == 0x000844, "Member 'AB_Prj_Athena_KnockGrenade_C::Radius' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, DeimosPawn) == 0x000848, "Member 'AB_Prj_Athena_KnockGrenade_C::DeimosPawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_KnockGrenade_C, WeaponImpact) == 0x000850, "Member 'AB_Prj_Athena_KnockGrenade_C::WeaponImpact' has a wrong offset!");

}

