#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_GrenadeLauncher_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_GrenadeLauncher_Athena.B_Prj_Ranged_GrenadeLauncher_Athena_C
// 0x01A8 (0x0940 - 0x0798)
class AB_Prj_Ranged_GrenadeLauncher_Athena_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0798(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortCollisionAudioComponent*           FortCollisionAudio;                                // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Weapon_LAU_Quad_RocketInAir_Cue;                   // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_GL_Ribbon_SmokeTrail;                            // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        RibbonTrail_PS;                                    // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RibbonTrail_PSC;                                   // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrailLifetime;                                     // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              WaterPhysMat;                                      // 0x07D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Bounce_WaterSplash_PS;                             // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               WaterSplash_PSC;                                   // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Bounce_Generic_PSC;                                // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Bounce_Generic_PS;                                 // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_PS;                                      // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_PSC;                                     // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StopLocation;                                      // 0x0808(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectsToTraceAgainst;                             // 0x0818(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FRotator                               StopRotX;                                          // 0x0828(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_834[0x4];                                      // 0x0834(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Grenade_Explosion_Sound;                           // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Water_PS;                                // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Water_PSC;                               // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnBounceFXHitActor;                             // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             OnBounceHitResult;                                 // 0x0860(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         FuseTimer_Spawn;                                   // 0x08E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuseTimerAfterBounce;                              // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               WaterLandDelayRipplePSC;                           // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WaterLandDelayPS;                                  // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               GrenadeInWaterLocation;                            // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Grenade_Explosion_Water_Sound;                     // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              StopSurfaceType;                                   // 0x0910(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x3];                                      // 0x0911(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               StopRotZ;                                          // 0x0914(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackNear;                        // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackFar;                         // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Grenade_Bounce_Water_Sound;                        // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Grenade_Bounce_Sound;                              // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Athena(int32 EntryPoint);
	void ReceiveDestroyed();
	void DelayBeforeExplode_();
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void FuseTimerMax();
	void ReceiveBeginPlay();
	void OnStop(const struct FHitResult& Hit);
	void UserConstructionScript();
	void SpawnBounceFX(struct FHitResult& Hit, class AActor** HitActor, EPhysicalSurface* SurfaceType, struct FRotator* HitResultRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_GrenadeLauncher_Athena_C">();
	}
	static class AB_Prj_Ranged_GrenadeLauncher_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_GrenadeLauncher_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_GrenadeLauncher_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Ranged_GrenadeLauncher_Athena_C");
static_assert(sizeof(AB_Prj_Ranged_GrenadeLauncher_Athena_C) == 0x000940, "Wrong size on AB_Prj_Ranged_GrenadeLauncher_Athena_C");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, UberGraphFrame) == 0x000798, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, FortCollisionAudio) == 0x0007A0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::FortCollisionAudio' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Weapon_LAU_Quad_RocketInAir_Cue) == 0x0007A8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Weapon_LAU_Quad_RocketInAir_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, P_GL_Ribbon_SmokeTrail) == 0x0007B0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::P_GL_Ribbon_SmokeTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Mesh) == 0x0007B8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, RibbonTrail_PS) == 0x0007C0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::RibbonTrail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, RibbonTrail_PSC) == 0x0007C8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::RibbonTrail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, TrailLifetime) == 0x0007D0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, WaterPhysMat) == 0x0007D4, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::WaterPhysMat' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Bounce_WaterSplash_PS) == 0x0007D8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Bounce_WaterSplash_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, WaterSplash_PSC) == 0x0007E0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::WaterSplash_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Bounce_Generic_PSC) == 0x0007E8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Bounce_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Bounce_Generic_PS) == 0x0007F0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Bounce_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Explosion_PS) == 0x0007F8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Explosion_PSC) == 0x000800, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, StopLocation) == 0x000808, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, ObjectsToTraceAgainst) == 0x000818, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::ObjectsToTraceAgainst' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, StopRotX) == 0x000828, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::StopRotX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Grenade_Explosion_Sound) == 0x000838, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Grenade_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Explosion_Flesh_Damage_PS) == 0x000840, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Explosion_Water_PS) == 0x000848, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Explosion_Water_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Explosion_Water_PSC) == 0x000850, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Explosion_Water_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, SpawnBounceFXHitActor) == 0x000858, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::SpawnBounceFXHitActor' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, OnBounceHitResult) == 0x000860, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::OnBounceHitResult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, FuseTimer_Spawn) == 0x0008E8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::FuseTimer_Spawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, FuseTimerAfterBounce) == 0x0008EC, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::FuseTimerAfterBounce' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, WaterLandDelayRipplePSC) == 0x0008F0, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::WaterLandDelayRipplePSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, WaterLandDelayPS) == 0x0008F8, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::WaterLandDelayPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, GrenadeInWaterLocation) == 0x000900, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::GrenadeInWaterLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Grenade_Explosion_Water_Sound) == 0x000908, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Grenade_Explosion_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, StopSurfaceType) == 0x000910, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::StopSurfaceType' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, StopRotZ) == 0x000914, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::StopRotZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, ExplosionForceFeedbackNear) == 0x000920, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::ExplosionForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, ExplosionForceFeedbackFar) == 0x000928, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::ExplosionForceFeedbackFar' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Grenade_Bounce_Water_Sound) == 0x000930, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Grenade_Bounce_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_GrenadeLauncher_Athena_C, Grenade_Bounce_Sound) == 0x000938, "Member 'AB_Prj_Ranged_GrenadeLauncher_Athena_C::Grenade_Bounce_Sound' has a wrong offset!");

}

