#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_SuperTowerGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ECardinalDirection_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_SuperTowerGrenade.B_Prj_Athena_SuperTowerGrenade_C
// 0x0220 (0x09D8 - 0x07B8)
class AB_Prj_Athena_SuperTowerGrenade_C : public AFortSuperTowerGrenadeProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BaseDestination;                                   // 0x07D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E4[0x4];                                      // 0x07E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        P_BuildBuilding;                                   // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_DistantSound;                                  // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GridExplosionOffset;                               // 0x0800(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeXY;                                        // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeZ;                                         // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridYOffset;                                       // 0x0814(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridZOffset;                                       // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CardinalDirection;                                 // 0x081C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D[0x3];                                      // 0x081D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECardinalDirection, float>               OrientationYawOffsets;                             // 0x0820(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<ECardinalDirection, struct FVector>      OrientationLocationOffsets;                        // 0x0870(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsDebug;                                           // 0x08C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C1[0x3];                                      // 0x08C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TireBuildDelay;                                    // 0x08C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ClearedCells_Normal;                               // 0x08C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                LastBounceLocation;                                // 0x08D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinBounceDistance;                                 // 0x08E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastBounceTime;                                    // 0x08E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTimeBetweenBounces;                             // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BounceSound;                                       // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ClearedCells_Underground;                          // 0x08F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                         BGAClasses_Tires;                                  // 0x0908(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        BGALocations_Tires;                                // 0x0918(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FRotator>                       BGARotations_Tires;                                // 0x0928(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<ECardinalDirection, struct FVector>      OrientationDoortraceOffsets;                       // 0x0938(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                DoorTraceOffsetHigh;                               // 0x0988(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorTraceOffsetLow;                                // 0x0994(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          b_HitTerrain;                                      // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             InAirLoopSound;                                    // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        InAirLoopComponent;                                // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BounceTimeout;                                     // 0x09B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BC[0x4];                                      // 0x09BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 BuilderClass;                                      // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BuilderClassBasement;                              // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          b_SpawnTires;                                      // 0x09D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_SuperTowerGrenade(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Delete_another_actor();
	void Handle_Bounce(const struct FVector& Hit_Location);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnStop(const struct FHitResult& Hit);
	void UserConstructionScript();
	void SetBaseDestination(const struct FHitResult& Hit);
	void CreateBaseSection(const struct FVector& ReferenceLocation, const TArray<class UClass*>& BGAClassArray, TArray<struct FVector>& BGALocationArray, TArray<struct FRotator>& BGARotationArray);
	void ClearAndBuild(TArray<struct FVector>& ClearedGridCells, const TArray<class UClass*>& BGAClassArray, TArray<struct FVector>& BGALocationArray, TArray<struct FRotator>& BGARotationArray, bool DestroyFloorsQuickly);
	void SpawnTires(const struct FVector& ReferenceLocation);
	void HandleProps(TArray<class AActor*>& Array);
	void CalculateCardinalDirection();
	void CallDynamicBuilder(class UClass* Class_0, const struct FVector& Location);
	void ClearOnly(TArray<struct FVector>& ClearedGridCells, bool DestroyFloorsQuickly);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_SuperTowerGrenade_C">();
	}
	static class AB_Prj_Athena_SuperTowerGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_SuperTowerGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_SuperTowerGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_SuperTowerGrenade_C");
static_assert(sizeof(AB_Prj_Athena_SuperTowerGrenade_C) == 0x0009D8, "Wrong size on AB_Prj_Athena_SuperTowerGrenade_C");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, UberGraphFrame) == 0x0007B8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, ParticleSystem) == 0x0007C0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, Mesh) == 0x0007C8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, RotatingMovement) == 0x0007D0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BaseDestination) == 0x0007D8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BaseDestination' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, P_BuildBuilding) == 0x0007E8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::P_BuildBuilding' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, Cue_CloseSound) == 0x0007F0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, Cue_DistantSound) == 0x0007F8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::Cue_DistantSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, GridExplosionOffset) == 0x000800, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::GridExplosionOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, GridSizeXY) == 0x00080C, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::GridSizeXY' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, GridSizeZ) == 0x000810, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::GridSizeZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, GridYOffset) == 0x000814, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::GridYOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, GridZOffset) == 0x000818, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::GridZOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, CardinalDirection) == 0x00081C, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::CardinalDirection' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, OrientationYawOffsets) == 0x000820, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::OrientationYawOffsets' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, OrientationLocationOffsets) == 0x000870, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::OrientationLocationOffsets' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, IsDebug) == 0x0008C0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::IsDebug' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, TireBuildDelay) == 0x0008C4, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::TireBuildDelay' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, ClearedCells_Normal) == 0x0008C8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::ClearedCells_Normal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, LastBounceLocation) == 0x0008D8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::LastBounceLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, MinBounceDistance) == 0x0008E4, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::MinBounceDistance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, LastBounceTime) == 0x0008E8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::LastBounceTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, MinTimeBetweenBounces) == 0x0008EC, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::MinTimeBetweenBounces' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BounceSound) == 0x0008F0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BounceSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, ClearedCells_Underground) == 0x0008F8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::ClearedCells_Underground' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BGAClasses_Tires) == 0x000908, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BGAClasses_Tires' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BGALocations_Tires) == 0x000918, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BGALocations_Tires' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BGARotations_Tires) == 0x000928, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BGARotations_Tires' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, OrientationDoortraceOffsets) == 0x000938, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::OrientationDoortraceOffsets' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, DoorTraceOffsetHigh) == 0x000988, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::DoorTraceOffsetHigh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, DoorTraceOffsetLow) == 0x000994, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::DoorTraceOffsetLow' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, b_HitTerrain) == 0x0009A0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::b_HitTerrain' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, InAirLoopSound) == 0x0009A8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::InAirLoopSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, InAirLoopComponent) == 0x0009B0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::InAirLoopComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BounceTimeout) == 0x0009B8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BounceTimeout' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BuilderClass) == 0x0009C0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BuilderClass' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, BuilderClassBasement) == 0x0009C8, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::BuilderClassBasement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SuperTowerGrenade_C, b_SpawnTires) == 0x0009D0, "Member 'AB_Prj_Athena_SuperTowerGrenade_C::b_SpawnTires' has a wrong offset!");

}

