#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Arrow_Crossbow_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Arrow_Crossbow_Athena.B_Prj_Arrow_Crossbow_Athena_C
// 0x0020 (0x0860 - 0x0840)
class AB_Prj_Arrow_Crossbow_Athena_C : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Crossbow_Projectile;                             // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        HitPlayerEffect;                                   // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               HitEffectPlayer;                                   // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Arrow_Crossbow_Athena(int32 EntryPoint);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void UserConstructionScript();
	void HitBlockingMeshOnPlayer_(class AActor* HitActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Arrow_Crossbow_Athena_C">();
	}
	static class AB_Prj_Arrow_Crossbow_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Arrow_Crossbow_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Arrow_Crossbow_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Arrow_Crossbow_Athena_C");
static_assert(sizeof(AB_Prj_Arrow_Crossbow_Athena_C) == 0x000860, "Wrong size on AB_Prj_Arrow_Crossbow_Athena_C");
static_assert(offsetof(AB_Prj_Arrow_Crossbow_Athena_C, UberGraphFrame) == 0x000840, "Member 'AB_Prj_Arrow_Crossbow_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_Crossbow_Athena_C, P_Crossbow_Projectile) == 0x000848, "Member 'AB_Prj_Arrow_Crossbow_Athena_C::P_Crossbow_Projectile' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_Crossbow_Athena_C, HitPlayerEffect) == 0x000850, "Member 'AB_Prj_Arrow_Crossbow_Athena_C::HitPlayerEffect' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_Crossbow_Athena_C, HitEffectPlayer) == 0x000858, "Member 'AB_Prj_Arrow_Crossbow_Athena_C::HitEffectPlayer' has a wrong offset!");

}

