#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Launcher_FrontAction

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Launcher_FrontAction.BP_Launcher_FrontAction_C
// 0x0090 (0x02F8 - 0x0268)
class UBP_Launcher_FrontAction_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_497F340240F0CC64E94B6DAF83B9813F; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_90E8D6E744D2D9DA5DE75A8AA3FAEEDC; // 0x0298(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_509BFA8742C047DE9209E1B642963779; // 0x02E0(0x0018)()

public:
	void ExecuteUbergraph_BP_Launcher_FrontAction(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Launcher_FrontAction_C">();
	}
	static class UBP_Launcher_FrontAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Launcher_FrontAction_C>();
	}
};
static_assert(alignof(UBP_Launcher_FrontAction_C) == 0x000008, "Wrong alignment on UBP_Launcher_FrontAction_C");
static_assert(sizeof(UBP_Launcher_FrontAction_C) == 0x0002F8, "Wrong size on UBP_Launcher_FrontAction_C");
static_assert(offsetof(UBP_Launcher_FrontAction_C, UberGraphFrame) == 0x000270, "Member 'UBP_Launcher_FrontAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Launcher_FrontAction_C, AnimGraphNode_Root_497F340240F0CC64E94B6DAF83B9813F) == 0x000278, "Member 'UBP_Launcher_FrontAction_C::AnimGraphNode_Root_497F340240F0CC64E94B6DAF83B9813F' has a wrong offset!");
static_assert(offsetof(UBP_Launcher_FrontAction_C, AnimGraphNode_Slot_90E8D6E744D2D9DA5DE75A8AA3FAEEDC) == 0x000298, "Member 'UBP_Launcher_FrontAction_C::AnimGraphNode_Slot_90E8D6E744D2D9DA5DE75A8AA3FAEEDC' has a wrong offset!");
static_assert(offsetof(UBP_Launcher_FrontAction_C, AnimGraphNode_LocalRefPose_509BFA8742C047DE9209E1B642963779) == 0x0002E0, "Member 'UBP_Launcher_FrontAction_C::AnimGraphNode_LocalRefPose_509BFA8742C047DE9209E1B642963779' has a wrong offset!");

}

