#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_Athena_SnapBoxToGrid

#include "Basic.hpp"

#include "BP_ProjectileTrajectory_Athena_classes.hpp"
#include "Engine_structs.hpp"
#include "ECardinalDirection_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C
// 0x0088 (0x0410 - 0x0388)
class ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C : public ABP_ProjectileTrajectory_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C; // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_BuildingPreview;                                // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Building;                                          // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeXY;                                        // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeZ;                                         // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridYOffset;                                       // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPointDist;                                     // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridZOffset;                                       // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               YawOffset;                                         // 0x03B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LastYawOffset;                                     // 0x03C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                GridSnapPosition;                                  // 0x03CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastGridSnapPosition;                              // 0x03D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             GridSnapSound;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CardinalDirection;                                 // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BuildingPreviewMesh;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaysetItemDefinition*             CachedPlayset;                                     // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Throw_Loop_Sound;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid(int32 EntryPoint);
	void ReceiveDestroyed();
	void SetTrajectorySpline(TArray<struct FVector>& SplinePoints, TArray<struct FVector>& SplineTangents);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void HandleGridSnapUpdates(const struct FVector& NewLocation);
	void UpdateScaleForPlayset();
	void GetPlaysetFromController(bool* bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C">();
	}
	static class ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C>();
	}
};
static_assert(alignof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000008, "Wrong alignment on ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C");
static_assert(sizeof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000410, "Wrong size on ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000388, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, SM_BuildingPreview) == 0x000390, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::SM_BuildingPreview' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, Building) == 0x000398, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::Building' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSizeXY) == 0x0003A0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSizeXY' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSizeZ) == 0x0003A4, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSizeZ' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridYOffset) == 0x0003A8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridYOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastPointDist) == 0x0003AC, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastPointDist' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridZOffset) == 0x0003B0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridZOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, YawOffset) == 0x0003B4, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::YawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastYawOffset) == 0x0003C0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastYawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSnapPosition) == 0x0003CC, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastGridSnapPosition) == 0x0003D8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastGridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSnapSound) == 0x0003E8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSnapSound' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, CardinalDirection) == 0x0003F0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::CardinalDirection' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, BuildingPreviewMesh) == 0x0003F8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::BuildingPreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, CachedPlayset) == 0x000400, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::CachedPlayset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, Throw_Loop_Sound) == 0x000408, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::Throw_Loop_Sound' has a wrong offset!");

}

