#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerOptionsTile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.ExecuteUbergraph_CreativeServerOptionsTile
// 0x0150 (0x0150 - 0x0000)
struct CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUISubsystem*                     CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortCreativeServerInfo*          K2Node_Event_ServerInfo;                           // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bUsingGamepad;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select1_Default;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x00B0(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue1;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue3;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue1;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue3;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0138(0x0018)()
};
static_assert(alignof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile");
static_assert(sizeof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile) == 0x000150, "Wrong size on CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, EntryPoint) == 0x000000, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable) == 0x000014, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_class_Variable) == 0x000018, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_class_Variable1) == 0x000020, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable1) == 0x000028, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_float_Variable) == 0x00002C, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable2) == 0x000038, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable3) == 0x000039, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_Event_IsDesignTime) == 0x00003A, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_ComponentBoundEvent_Button4) == 0x000040, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_GetEndTime_ReturnValue) == 0x000048, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_ComponentBoundEvent_Button3) == 0x000068, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_Event_ServerInfo) == 0x000070, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_Event_ServerInfo' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimationReverse_ReturnValue1) == 0x000078, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimationReverse_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_ComponentBoundEvent_Button2) == 0x000080, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable4) == 0x000088, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_CustomEvent_bUsingGamepad) == 0x000089, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_CustomEvent_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_Select_Default) == 0x00008A, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_Select1_Default) == 0x000090, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_text_Variable) == 0x000098, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_text_Variable1) == 0x0000B0, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_ComponentBoundEvent_Button1) == 0x0000C8, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_ComponentBoundEvent_Button) == 0x0000D0, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimationReverse_ReturnValue2) == 0x0000D8, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimationReverse_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimationForward_ReturnValue1) == 0x0000E0, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimationForward_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimation_ReturnValue1) == 0x0000E8, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PauseAnimation_ReturnValue) == 0x0000F0, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimationReverse_ReturnValue3) == 0x0000F8, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimationReverse_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_GetStartTime_ReturnValue) == 0x000100, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PauseAnimation_ReturnValue1) == 0x000104, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PauseAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000108, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_Add_FloatFloat_ReturnValue) == 0x00010C, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimation_ReturnValue2) == 0x000110, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_GetEndTime_ReturnValue1) == 0x000118, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_GetEndTime_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00011C, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_Select2_Default) == 0x000120, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, CallFunc_PlayAnimation_ReturnValue3) == 0x000128, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::CallFunc_PlayAnimation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable5) == 0x000130, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, K2Node_Select3_Default) == 0x000138, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::K2Node_Select3_Default' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.InputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativeServerOptionsTile_C_InputTypeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeServerOptionsTile_C_InputTypeChanged) == 0x000001, "Wrong alignment on CreativeServerOptionsTile_C_InputTypeChanged");
static_assert(sizeof(CreativeServerOptionsTile_C_InputTypeChanged) == 0x000001, "Wrong size on CreativeServerOptionsTile_C_InputTypeChanged");
static_assert(offsetof(CreativeServerOptionsTile_C_InputTypeChanged, bUsingGamepad) == 0x000000, "Member 'CreativeServerOptionsTile_C_InputTypeChanged::bUsingGamepad' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.SetBPData
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_SetBPData final
{
public:
	const class UFortCreativeServerInfo*          ServerInfo;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_SetBPData) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_SetBPData");
static_assert(sizeof(CreativeServerOptionsTile_C_SetBPData) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_SetBPData");
static_assert(offsetof(CreativeServerOptionsTile_C_SetBPData, ServerInfo) == 0x000000, "Member 'CreativeServerOptionsTile_C_SetBPData::ServerInfo' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CreativeServerOptionsTile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeServerOptionsTile_C_PreConstruct) == 0x000001, "Wrong alignment on CreativeServerOptionsTile_C_PreConstruct");
static_assert(sizeof(CreativeServerOptionsTile_C_PreConstruct) == 0x000001, "Wrong size on CreativeServerOptionsTile_C_PreConstruct");
static_assert(offsetof(CreativeServerOptionsTile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CreativeServerOptionsTile_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.InitServerInfo
// 0x0210 (0x0210 - 0x0000)
struct CreativeServerOptionsTile_C_InitServerInfo final
{
public:
	class UFortCreativeServerInfo*                ServerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue2;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00B8(0x0018)()
	bool                                          Temp_bool_Variable1;                               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item1;                          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue1;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsDate_DateTime_ReturnValue;              // 0x0108(0x0018)()
	bool                                          CallFunc_IsCreativeModeAccessLimited_ReturnValue;  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0128(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0178(0x0018)()
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01A0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x01B8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select1_Default;                            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeServerFriend_C*                K2Node_DynamicCast_AsCreative_Server_Friend;       // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select2_Default;                            // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_InitServerInfo) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_InitServerInfo");
static_assert(sizeof(CreativeServerOptionsTile_C_InitServerInfo) == 0x000210, "Wrong size on CreativeServerOptionsTile_C_InitServerInfo");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, ServerInfo) == 0x000000, "Member 'CreativeServerOptionsTile_C_InitServerInfo::ServerInfo' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable) == 0x000008, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_byte_Variable) == 0x000009, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Get_Item) == 0x000010, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCharacterAsNumber_ReturnValue) == 0x000024, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCharacterAsNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCharacterAsNumber_ReturnValue1) == 0x000028, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCharacterAsNumber_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCharacterAsNumber_ReturnValue2) == 0x00002C, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCharacterAsNumber_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Add_IntInt_ReturnValue1) == 0x000034, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Length_ReturnValue1) == 0x000038, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeArray_Array) == 0x000088, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Format_ReturnValue) == 0x000098, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_byte_Variable1) == 0x0000B0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_TextToUpper_ReturnValue) == 0x0000B8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable1) == 0x0000D0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_int_Array_Index_Variable) == 0x0000D4, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select_Default) == 0x0000D8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Get_Item1) == 0x0000E0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000F0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue) == 0x0000F8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue1) == 0x000100, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_AsDate_DateTime_ReturnValue) == 0x000108, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_AsDate_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_IsCreativeModeAccessLimited_ReturnValue) == 0x000120, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_IsCreativeModeAccessLimited_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeStruct_FormatArgumentData1) == 0x000128, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeArray_Array1) == 0x000168, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Format_ReturnValue1) == 0x000178, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_JoinStringArray_ReturnValue) == 0x000190, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0001A0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_TextToUpper_ReturnValue1) == 0x0001B8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Length_ReturnValue2) == 0x0001D0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Greater_IntInt_ReturnValue1) == 0x0001D4, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable2) == 0x0001D5, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_BP_CreateEntry_ReturnValue) == 0x0001D8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select1_Default) == 0x0001E0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_DynamicCast_AsCreative_Server_Friend) == 0x0001E8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_DynamicCast_AsCreative_Server_Friend' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select2_Default) == 0x0001F8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_int_Loop_Counter_Variable) == 0x000200, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000204, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Add_IntInt_ReturnValue2) == 0x000208, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.SetBGImage
// 0x00C8 (0x00C8 - 0x0000)
struct CreativeServerOptionsTile_C_SetBGImage final
{
public:
	int32                                         ArrayIdx;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortCreativeServerDisplayOption       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RGBToHSV_H;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_S;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_V;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_A;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_H1;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_S1;                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_V1;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_A1;                              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue1;                    // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeServerOptionsTile_C_SetBGImage) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_SetBGImage");
static_assert(sizeof(CreativeServerOptionsTile_C_SetBGImage) == 0x0000C8, "Wrong size on CreativeServerOptionsTile_C_SetBGImage");
static_assert(offsetof(CreativeServerOptionsTile_C_SetBGImage, ArrayIdx) == 0x000000, "Member 'CreativeServerOptionsTile_C_SetBGImage::ArrayIdx' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_SetBGImage, CallFunc_Percent_IntInt_ReturnValue) == 0x000004, "Member 'CreativeServerOptionsTile_C_SetBGImage::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_SetBGImage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CreativeServerOptionsTile_C_SetBGImage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
