#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cube_Dest_Scripting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.ExecuteUbergraph_Cube_Dest_Scripting
// 0x0080 (0x0080 - 0x0000)
struct Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentIndex)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACUBE_C*>                        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class ACUBE_C*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentIndex;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting) == 0x000008, "Wrong alignment on Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting");
static_assert(sizeof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting) == 0x000080, "Wrong size on Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, EntryPoint) == 0x000000, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_IsDedicatedServer_ReturnValue) == 0x000014, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000018, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x000020, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x000028, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000030, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_Array_Get_Item) == 0x000048, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000051, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000054, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, K2Node_CustomEvent_CurrentIndex) == 0x000060, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::K2Node_CustomEvent_CurrentIndex' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_IsValid_ReturnValue1) == 0x000064, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x000068, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting, CallFunc_SpawnSoundAtLocation_ReturnValue1) == 0x000078, "Member 'Cube_Dest_Scripting_C_ExecuteUbergraph_Cube_Dest_Scripting::CallFunc_SpawnSoundAtLocation_ReturnValue1' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.CubeDone
// 0x0004 (0x0004 - 0x0000)
struct Cube_Dest_Scripting_C_CubeDone final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cube_Dest_Scripting_C_CubeDone) == 0x000004, "Wrong alignment on Cube_Dest_Scripting_C_CubeDone");
static_assert(sizeof(Cube_Dest_Scripting_C_CubeDone) == 0x000004, "Wrong size on Cube_Dest_Scripting_C_CubeDone");
static_assert(offsetof(Cube_Dest_Scripting_C_CubeDone, CurrentIndex) == 0x000000, "Member 'Cube_Dest_Scripting_C_CubeDone::CurrentIndex' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.OnRep_CubeSinking
// 0x00A8 (0x00A8 - 0x0000)
struct Cube_Dest_Scripting_C_OnRep_CubeSinking final
{
public:
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x001C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Cube_Dest_Scripting_C_OnRep_CubeSinking) == 0x000008, "Wrong alignment on Cube_Dest_Scripting_C_OnRep_CubeSinking");
static_assert(sizeof(Cube_Dest_Scripting_C_OnRep_CubeSinking) == 0x0000A8, "Wrong size on Cube_Dest_Scripting_C_OnRep_CubeSinking");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_CubeSinking, CallFunc_Conv_ByteToString_ReturnValue) == 0x000000, "Member 'Cube_Dest_Scripting_C_OnRep_CubeSinking::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_CubeSinking, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'Cube_Dest_Scripting_C_OnRep_CubeSinking::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_CubeSinking, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000018, "Member 'Cube_Dest_Scripting_C_OnRep_CubeSinking::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_CubeSinking, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00001C, "Member 'Cube_Dest_Scripting_C_OnRep_CubeSinking::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.OnRep_LakeTurnedOn
// 0x0040 (0x0040 - 0x0000)
struct Cube_Dest_Scripting_C_OnRep_LakeTurnedOn final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AmbientLakeAudioActor_C*            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AmbientSplineActor_C*               CallFunc_Array_Get_Item1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn) == 0x000008, "Wrong alignment on Cube_Dest_Scripting_C_OnRep_LakeTurnedOn");
static_assert(sizeof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn) == 0x000040, "Wrong size on Cube_Dest_Scripting_C_OnRep_LakeTurnedOn");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, Temp_int_Array_Index_Variable1) == 0x00000C, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, Temp_int_Loop_Counter_Variable1) == 0x000010, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Add_IntInt_ReturnValue1) == 0x000018, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Array_Get_Item) == 0x000020, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Array_Get_Item1) == 0x000028, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Array_Length_ReturnValue1) == 0x000034, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeTurnedOn, CallFunc_Less_IntInt_ReturnValue1) == 0x000039, "Member 'Cube_Dest_Scripting_C_OnRep_LakeTurnedOn::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.CorruptRiverAudioActor
// 0x0010 (0x0010 - 0x0000)
struct Cube_Dest_Scripting_C_CorruptRiverAudioActor final
{
public:
	class ABP_AmbientSplineActor_C*               River;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AmbientSplineActor_C*               RiverL;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cube_Dest_Scripting_C_CorruptRiverAudioActor) == 0x000008, "Wrong alignment on Cube_Dest_Scripting_C_CorruptRiverAudioActor");
static_assert(sizeof(Cube_Dest_Scripting_C_CorruptRiverAudioActor) == 0x000010, "Wrong size on Cube_Dest_Scripting_C_CorruptRiverAudioActor");
static_assert(offsetof(Cube_Dest_Scripting_C_CorruptRiverAudioActor, River) == 0x000000, "Member 'Cube_Dest_Scripting_C_CorruptRiverAudioActor::River' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_CorruptRiverAudioActor, RiverL) == 0x000008, "Member 'Cube_Dest_Scripting_C_CorruptRiverAudioActor::RiverL' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.ConvertLakeAudioActor
// 0x0008 (0x0008 - 0x0000)
struct Cube_Dest_Scripting_C_ConvertLakeAudioActor final
{
public:
	class ABP_AmbientLakeAudioActor_C*            Lake;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cube_Dest_Scripting_C_ConvertLakeAudioActor) == 0x000008, "Wrong alignment on Cube_Dest_Scripting_C_ConvertLakeAudioActor");
static_assert(sizeof(Cube_Dest_Scripting_C_ConvertLakeAudioActor) == 0x000008, "Wrong size on Cube_Dest_Scripting_C_ConvertLakeAudioActor");
static_assert(offsetof(Cube_Dest_Scripting_C_ConvertLakeAudioActor, Lake) == 0x000000, "Member 'Cube_Dest_Scripting_C_ConvertLakeAudioActor::Lake' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.UpdateCorruption
// 0x001C (0x001C - 0x0000)
struct Cube_Dest_Scripting_C_UpdateCorruption final
{
public:
	float                                         PercentComplete;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cube_Dest_Scripting_C_UpdateCorruption) == 0x000004, "Wrong alignment on Cube_Dest_Scripting_C_UpdateCorruption");
static_assert(sizeof(Cube_Dest_Scripting_C_UpdateCorruption) == 0x00001C, "Wrong size on Cube_Dest_Scripting_C_UpdateCorruption");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, PercentComplete) == 0x000000, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::PercentComplete' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_UpdateCorruption, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'Cube_Dest_Scripting_C_UpdateCorruption::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.OnRep_LakeState
// 0x0001 (0x0001 - 0x0000)
struct Cube_Dest_Scripting_C_OnRep_LakeState final
{
public:
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cube_Dest_Scripting_C_OnRep_LakeState) == 0x000001, "Wrong alignment on Cube_Dest_Scripting_C_OnRep_LakeState");
static_assert(sizeof(Cube_Dest_Scripting_C_OnRep_LakeState) == 0x000001, "Wrong size on Cube_Dest_Scripting_C_OnRep_LakeState");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_LakeState, K2Node_SwitchInteger_CmpSuccess) == 0x000000, "Member 'Cube_Dest_Scripting_C_OnRep_LakeState::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function Cube_Dest_Scripting.Cube_Dest_Scripting_C.OnRep_IsCubeSinking
// 0x00B8 (0x00B8 - 0x0000)
struct Cube_Dest_Scripting_C_OnRep_IsCubeSinking final
{
public:
	class ACUBE_C*                                K2Node_DynamicCast_AsCUBE;                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking) == 0x000008, "Wrong alignment on Cube_Dest_Scripting_C_OnRep_IsCubeSinking");
static_assert(sizeof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking) == 0x0000B8, "Wrong size on Cube_Dest_Scripting_C_OnRep_IsCubeSinking");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, K2Node_DynamicCast_AsCUBE) == 0x000000, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::K2Node_DynamicCast_AsCUBE' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, K2Node_SwitchInteger_CmpSuccess) == 0x000009, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, CallFunc_Conv_ByteToString_ReturnValue) == 0x000010, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000028, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cube_Dest_Scripting_C_OnRep_IsCubeSinking, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00002C, "Member 'Cube_Dest_Scripting_C_OnRep_IsCubeSinking::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

