#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Throw_SneakySnowman

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Throw_SneakySnowman.GA_Athena_Throw_SneakySnowman_C.ExecuteUbergraph_GA_Athena_Throw_SneakySnowman
// 0x000C (0x000C - 0x0000)
struct GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman) == 0x000004, "Wrong alignment on GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman");
static_assert(sizeof(GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman) == 0x00000C, "Wrong size on GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman, EntryPoint) == 0x000000, "Member 'GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Athena_Throw_SneakySnowman_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowman::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Athena_Throw_SneakySnowman.GA_Athena_Throw_SneakySnowman_C.SpawnLocationAndRotation
// 0x0080 (0x0080 - 0x0000)
struct GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation final
{
public:
	struct FVector                                OutLoc;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRot;                                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     CallFunc_GetVehicle_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGolfCartVehicleSK_C*                   K2Node_DynamicCast_AsGolf_Cart_Vehicle_SK;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation) == 0x000008, "Wrong alignment on GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation");
static_assert(sizeof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation) == 0x000080, "Wrong size on GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, OutLoc) == 0x000000, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, OutRot) == 0x00000C, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, Temp_bool_Variable) == 0x000018, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_SpawnLocationAndRotation_OutLoc) == 0x00001C, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_SpawnLocationAndRotation_OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_SpawnLocationAndRotation_OutRot) == 0x000028, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_SpawnLocationAndRotation_OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000038, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_GetVehicle_ReturnValue) == 0x000050, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_GetVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, K2Node_DynamicCast_AsGolf_Cart_Vehicle_SK) == 0x000068, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::K2Node_DynamicCast_AsGolf_Cart_Vehicle_SK' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation, K2Node_Select_Default) == 0x000074, "Member 'GA_Athena_Throw_SneakySnowman_C_SpawnLocationAndRotation::K2Node_Select_Default' has a wrong offset!");

}

