#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Bush

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Bush.GA_Athena_Bush_C
// 0x00B0 (0x09E8 - 0x0938)
class UGA_Athena_Bush_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFortGameplayAbilityMontageInfo        AnimMontageInfo;                                   // 0x0940(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerDuration;                                   // 0x09A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    UseBushObjectiveStat;                              // 0x09A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AAthena_Player_Bush_C*                  PlayerBush;                                        // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BushTag;                                           // 0x09C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   BushHolsterSelf;                                   // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Bush(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Triggered_6FA77BEE4AD5C961BBDC6682C81BD718(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_6FA77BEE4AD5C961BBDC6682C81BD718(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Bush_C">();
	}
	static class UGA_Athena_Bush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Bush_C>();
	}
};
static_assert(alignof(UGA_Athena_Bush_C) == 0x000008, "Wrong alignment on UGA_Athena_Bush_C");
static_assert(sizeof(UGA_Athena_Bush_C) == 0x0009E8, "Wrong size on UGA_Athena_Bush_C");
static_assert(offsetof(UGA_Athena_Bush_C, UberGraphFrame) == 0x000938, "Member 'UGA_Athena_Bush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, AnimMontageInfo) == 0x000940, "Member 'UGA_Athena_Bush_C::AnimMontageInfo' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, PlayerPawn) == 0x000998, "Member 'UGA_Athena_Bush_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, TriggerDuration) == 0x0009A0, "Member 'UGA_Athena_Bush_C::TriggerDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, UseBushObjectiveStat) == 0x0009A8, "Member 'UGA_Athena_Bush_C::UseBushObjectiveStat' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, PlayerBush) == 0x0009B8, "Member 'UGA_Athena_Bush_C::PlayerBush' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, BushTag) == 0x0009C0, "Member 'UGA_Athena_Bush_C::BushTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Bush_C, BushHolsterSelf) == 0x0009E0, "Member 'UGA_Athena_Bush_C::BushHolsterSelf' has a wrong offset!");

}

