#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_ReleaseConditions

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Balloons_ReleaseConditions.GA_Athena_Balloons_ReleaseConditions_C.ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions
// 0x0278 (0x0278 - 0x0000)
struct GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0028(0x00A8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00E0(0x00A8)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0198(0x0040)(ContainsInstancedReference)
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01F0(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	class UGameplayAbility*                       Temp_object_Variable;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	class AB_UtilityItem_Balloons_Athena_C*       K2Node_DynamicCast_AsB_Utility_Item_Balloons_Athena; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAbilityActivate*       CallFunc_WaitForAbilityActivateWithTagRequirements_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue1;          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions) == 0x000008, "Wrong alignment on GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions");
static_assert(sizeof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions) == 0x000278, "Wrong size on GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, EntryPoint) == 0x000000, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000008, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_CustomEvent_Payload) == 0x000028, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_CreateDelegate_OutputDelegate1) == 0x0000D0, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, Temp_struct_Variable) == 0x0000E0, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_CreateDelegate_OutputDelegate2) == 0x000188, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_GetActorInfo_ReturnValue) == 0x000198, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_CustomEvent_ActivatedAbility) == 0x0001D8, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001E0, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001E9, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001F0, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000210, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, Temp_object_Variable) == 0x000220, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000228, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_CreateDelegate_OutputDelegate3) == 0x000230, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_DynamicCast_AsB_Utility_Item_Balloons_Athena) == 0x000240, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_DynamicCast_AsB_Utility_Item_Balloons_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, K2Node_DynamicCast_bSuccess1) == 0x000248, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_WaitForAbilityActivateWithTagRequirements_ReturnValue) == 0x000250, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_WaitForAbilityActivateWithTagRequirements_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_IsValid_ReturnValue1) == 0x000258, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000260, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_WaitGameplayTagAdd_ReturnValue1) == 0x000268, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_WaitGameplayTagAdd_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_IsValid_ReturnValue2) == 0x000270, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions, CallFunc_IsValid_ReturnValue3) == 0x000271, "Member 'GA_Athena_Balloons_ReleaseConditions_C_ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function GA_Athena_Balloons_ReleaseConditions.GA_Athena_Balloons_ReleaseConditions_C.EventReceived_F1071C264D39527F08E6C2952068C28B
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B) == 0x000008, "Wrong alignment on GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B");
static_assert(sizeof(GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B) == 0x0000A8, "Wrong size on GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B, Payload) == 0x000000, "Member 'GA_Athena_Balloons_ReleaseConditions_C_EventReceived_F1071C264D39527F08E6C2952068C28B::Payload' has a wrong offset!");

// Function GA_Athena_Balloons_ReleaseConditions.GA_Athena_Balloons_ReleaseConditions_C.OnActivate_1A489F684C338ABE95296EB4C5D51D1C
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C) == 0x000008, "Wrong alignment on GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C");
static_assert(sizeof(GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C) == 0x000008, "Wrong size on GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C");
static_assert(offsetof(GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C, ActivatedAbility) == 0x000000, "Member 'GA_Athena_Balloons_ReleaseConditions_C_OnActivate_1A489F684C338ABE95296EB4C5D51D1C::ActivatedAbility' has a wrong offset!");

}

