#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TNT_WithTrajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_Grenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_TNT_WithTrajectory.GA_Athena_TNT_WithTrajectory_C
// 0x0040 (0x0C78 - 0x0C38)
class UGA_Athena_TNT_WithTrajectory_C final : public UGA_Athena_Grenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_TNT_WithTrajectory_C;     // 0x0C38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FuseDuration;                                      // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CookHandle;                                        // 0x0C48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Fuse_Sound;                                        // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ExplosionCameraShake;                              // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    Projectile;                                        // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FusePitchHandle;                                   // 0x0C68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         GrenadeSpeedFumble;                                // 0x0C70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinFuseTime;                                       // 0x0C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_TNT_WithTrajectory(int32 EntryPoint);
	void K2_ActivateAbility();
	void AthenaProjectileSpawned(class AFortProjectileBase* ProjectileReference_0);
	void OnDamagedFatal(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Spawn_Server_Projectile_Involuntary(const struct FVector& Location, const struct FRotator& Direction, bool bAllowSpawnWhenDead, bool bAllowSpawnWhenDBNO);
	void OnPlayerStartDBNO();
	void K2_OnEndAbility(bool bWasCancelled);
	void InvoluntaryThrow();
	void Created_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Touched_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Bounced_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Stopped_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Exploded_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Destroyed_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void CurveRowLookup();

	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_TNT_WithTrajectory_C">();
	}
	static class UGA_Athena_TNT_WithTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_TNT_WithTrajectory_C>();
	}
};
static_assert(alignof(UGA_Athena_TNT_WithTrajectory_C) == 0x000008, "Wrong alignment on UGA_Athena_TNT_WithTrajectory_C");
static_assert(sizeof(UGA_Athena_TNT_WithTrajectory_C) == 0x000C78, "Wrong size on UGA_Athena_TNT_WithTrajectory_C");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, UberGraphFrame_GA_Athena_TNT_WithTrajectory_C) == 0x000C38, "Member 'UGA_Athena_TNT_WithTrajectory_C::UberGraphFrame_GA_Athena_TNT_WithTrajectory_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, FuseDuration) == 0x000C40, "Member 'UGA_Athena_TNT_WithTrajectory_C::FuseDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, CookHandle) == 0x000C48, "Member 'UGA_Athena_TNT_WithTrajectory_C::CookHandle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, Fuse_Sound) == 0x000C50, "Member 'UGA_Athena_TNT_WithTrajectory_C::Fuse_Sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, ExplosionCameraShake) == 0x000C58, "Member 'UGA_Athena_TNT_WithTrajectory_C::ExplosionCameraShake' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, Projectile) == 0x000C60, "Member 'UGA_Athena_TNT_WithTrajectory_C::Projectile' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, FusePitchHandle) == 0x000C68, "Member 'UGA_Athena_TNT_WithTrajectory_C::FusePitchHandle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, GrenadeSpeedFumble) == 0x000C70, "Member 'UGA_Athena_TNT_WithTrajectory_C::GrenadeSpeedFumble' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TNT_WithTrajectory_C, MinFuseTime) == 0x000C74, "Member 'UGA_Athena_TNT_WithTrajectory_C::MinFuseTime' has a wrong offset!");

}

