#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FireworksMortar_WithTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_FireworksMortar_WithTrajectory.GA_Athena_FireworksMortar_WithTrajectory_C.ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory
// 0x00E8 (0x00E8 - 0x0000)
struct GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortProjectileBase*                    K2Node_Event_ProjectileReference;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_FireworksMortar_Holder_C*        K2Node_DynamicCast_AsB_Prj_Fireworks_Mortar_Holder; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0030(0x00A8)()
	class AB_ProjectileTrajectory_Athena_FireworksMortar_C* K2Node_DynamicCast_AsB_Projectile_Trajectory_Athena_Fireworks_Mortar; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory");
static_assert(sizeof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory) == 0x0000E8, "Wrong size on GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, EntryPoint) == 0x000000, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x00000C, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, K2Node_Event_ProjectileReference) == 0x000018, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::K2Node_Event_ProjectileReference' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, K2Node_DynamicCast_AsB_Prj_Fireworks_Mortar_Holder) == 0x000020, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::K2Node_DynamicCast_AsB_Prj_Fireworks_Mortar_Holder' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, K2Node_MakeStruct_GameplayEventData) == 0x000030, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, K2Node_DynamicCast_AsB_Projectile_Trajectory_Athena_Fireworks_Mortar) == 0x0000D8, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::K2Node_DynamicCast_AsB_Projectile_Trajectory_Athena_Fireworks_Mortar' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory, K2Node_DynamicCast_bSuccess1) == 0x0000E0, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function GA_Athena_FireworksMortar_WithTrajectory.GA_Athena_FireworksMortar_WithTrajectory_C.AthenaProjectileSpawned
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned final
{
public:
	class AFortProjectileBase*                    ProjectileReference_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned");
static_assert(sizeof(GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned) == 0x000008, "Wrong size on GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned, ProjectileReference_0) == 0x000000, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_AthenaProjectileSpawned::ProjectileReference_0' has a wrong offset!");

// Function GA_Athena_FireworksMortar_WithTrajectory.GA_Athena_FireworksMortar_WithTrajectory_C.SetBalanceValues
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues) == 0x000004, "Wrong alignment on GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues");
static_assert(sizeof(GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues) == 0x000004, "Wrong size on GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues");
static_assert(offsetof(GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'GA_Athena_FireworksMortar_WithTrajectory_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

}

