#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FireworksMortar_ProjectileSpawn

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GAT_GenericTriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_FireworksMortar_ProjectileSpawn.GA_Athena_FireworksMortar_ProjectileSpawn_C
// 0x01A8 (0x0BB8 - 0x0A10)
class UGA_Athena_FireworksMortar_ProjectileSpawn_C final : public UGAT_GenericTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_FireworksMortar_ProjectileSpawn_C; // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AB_BGA_FireworksMortar_Holder_C*        RocketHolder;                                      // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Prj_BottleRocket;                                  // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnLocOffset;                                    // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BottleRocketSpeed;                                 // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BottleRocketSpeedVariance;                         // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spread;                                            // 0x0A34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnDelayVarience;                                // 0x0A38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnDelay;                                        // 0x0A3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       GECS_Explode;                                      // 0x0A40(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_Targeting;                                       // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MaxShots;                                          // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShotsFired;                                        // 0x0ACC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighShot;                                          // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseBalanceRows;                                    // 0x0AD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD2[0x6];                                      // 0x0AD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_RocketSpeed;                                   // 0x0AD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_RocketSpeedVariance;                           // 0x0AF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnDelay;                                    // 0x0B18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnDelayVariance;                            // 0x0B38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxShots;                                      // 0x0B58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Spread;                                        // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_HighShot;                                      // 0x0B98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_FireworksMortar_ProjectileSpawn(int32 EntryPoint);
	void FireRockets();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);
	void SpawnRocket();
	void AddVariance(float Default, float Variance, float* RandomFloat);
	void SetBalance();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_FireworksMortar_ProjectileSpawn_C">();
	}
	static class UGA_Athena_FireworksMortar_ProjectileSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FireworksMortar_ProjectileSpawn_C>();
	}
};
static_assert(alignof(UGA_Athena_FireworksMortar_ProjectileSpawn_C) == 0x000008, "Wrong alignment on UGA_Athena_FireworksMortar_ProjectileSpawn_C");
static_assert(sizeof(UGA_Athena_FireworksMortar_ProjectileSpawn_C) == 0x000BB8, "Wrong size on UGA_Athena_FireworksMortar_ProjectileSpawn_C");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, UberGraphFrame_GA_Athena_FireworksMortar_ProjectileSpawn_C) == 0x000A10, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::UberGraphFrame_GA_Athena_FireworksMortar_ProjectileSpawn_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, RocketHolder) == 0x000A18, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::RocketHolder' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Prj_BottleRocket) == 0x000A20, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Prj_BottleRocket' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, SpawnLocOffset) == 0x000A28, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::SpawnLocOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, BottleRocketSpeed) == 0x000A2C, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::BottleRocketSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, BottleRocketSpeedVariance) == 0x000A30, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::BottleRocketSpeedVariance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Spread) == 0x000A34, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Spread' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, SpawnDelayVarience) == 0x000A38, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::SpawnDelayVarience' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, SpawnDelay) == 0x000A3C, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::SpawnDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, GECS_Explode) == 0x000A40, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::GECS_Explode' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, T_Targeting) == 0x000AC0, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::T_Targeting' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, MaxShots) == 0x000AC8, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::MaxShots' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, ShotsFired) == 0x000ACC, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::ShotsFired' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, HighShot) == 0x000AD0, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::HighShot' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, UseBalanceRows) == 0x000AD1, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::UseBalanceRows' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_RocketSpeed) == 0x000AD8, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_RocketSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_RocketSpeedVariance) == 0x000AF8, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_RocketSpeedVariance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_SpawnDelay) == 0x000B18, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_SpawnDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_SpawnDelayVariance) == 0x000B38, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_SpawnDelayVariance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_MaxShots) == 0x000B58, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_MaxShots' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_Spread) == 0x000B78, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_Spread' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FireworksMortar_ProjectileSpawn_C, Row_HighShot) == 0x000B98, "Member 'UGA_Athena_FireworksMortar_ProjectileSpawn_C::Row_HighShot' has a wrong offset!");

}

