#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_AltFireRelease

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C.ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease
// 0x01B0 (0x01B0 - 0x0000)
struct GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0028(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable1;                             // 0x0058(0x0020)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0078(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00C8(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData1;                    // 0x00F8(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag1;                // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0138(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_UtilityItem_Balloons_Athena_C*       K2Node_DynamicCast_AsB_Utility_Item_Balloons_Athena; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsMale;                         // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsFemale;                       // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease) == 0x000008, "Wrong alignment on GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease");
static_assert(sizeof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease) == 0x0001B0, "Wrong size on GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, EntryPoint) == 0x000000, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CreateDelegate_OutputDelegate1) == 0x000014, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CustomEvent_TargetData) == 0x000028, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CustomEvent_ApplicationTag) == 0x000048, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, Temp_struct_Variable) == 0x000050, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, Temp_struct_Variable1) == 0x000058, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_GetActorInfo_ReturnValue) == 0x000078, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000B8, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000C8, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E8, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CustomEvent_TargetData1) == 0x0000F8, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CustomEvent_TargetData1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CustomEvent_ApplicationTag1) == 0x000118, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CustomEvent_ApplicationTag1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CreateDelegate_OutputDelegate2) == 0x000120, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_K2_CommitAbility_ReturnValue) == 0x000130, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CustomEvent_TargetData2) == 0x000138, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_CustomEvent_ApplicationTag2) == 0x000158, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_GetController_ReturnValue) == 0x000168, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_IsDBNO_ReturnValue) == 0x000170, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000178, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_DynamicCast_bSuccess1) == 0x000180, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_Event_bWasCancelled) == 0x000181, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000188, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_DynamicCast_AsB_Utility_Item_Balloons_Athena) == 0x000190, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_DynamicCast_AsB_Utility_Item_Balloons_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, K2Node_DynamicCast_bSuccess2) == 0x000198, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x0001A0, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_GetValidValue_ReturnValue) == 0x0001A8, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A9, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_IsValid_ReturnValue1) == 0x0001AA, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_IsFalling_ReturnValue) == 0x0001AB, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_BooleanOR_ReturnValue) == 0x0001AC, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_GetGender_IsMale) == 0x0001AD, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_GetGender_IsMale' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease, CallFunc_GetGender_IsFemale) == 0x0001AE, "Member 'GA_Athena_Balloons_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease::CallFunc_GetGender_IsFemale' has a wrong offset!");

// Function GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C.Triggered_EF0D7C2A4633499E50EA929A49BF25DD
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD) == 0x000008, "Wrong alignment on GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD");
static_assert(sizeof(GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD) == 0x000028, "Wrong size on GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD, TargetData) == 0x000000, "Member 'GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD, ApplicationTag) == 0x000020, "Member 'GA_Athena_Balloons_AltFireRelease_C_Triggered_EF0D7C2A4633499E50EA929A49BF25DD::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C.Cancelled_EF0D7C2A4633499E50EA929A49BF25DD
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD) == 0x000008, "Wrong alignment on GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD");
static_assert(sizeof(GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD) == 0x000028, "Wrong size on GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD, TargetData) == 0x000000, "Member 'GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD, ApplicationTag) == 0x000020, "Member 'GA_Athena_Balloons_AltFireRelease_C_Cancelled_EF0D7C2A4633499E50EA929A49BF25DD::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C.Completed_EF0D7C2A4633499E50EA929A49BF25DD
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD) == 0x000008, "Wrong alignment on GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD");
static_assert(sizeof(GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD) == 0x000028, "Wrong size on GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD, TargetData) == 0x000000, "Member 'GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD, ApplicationTag) == 0x000020, "Member 'GA_Athena_Balloons_AltFireRelease_C_Completed_EF0D7C2A4633499E50EA929A49BF25DD::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          HasBalloons;                                       // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumActiveBalloons_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility) == 0x000080, "Wrong size on GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, HasBalloons) == 0x000061, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::HasBalloons' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000068, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, CallFunc_GetNumActiveBalloons_ReturnValue) == 0x000074, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::CallFunc_GetNumActiveBalloons_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'GA_Athena_Balloons_AltFireRelease_C_K2_CanActivateAbility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

