#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Bush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Bush.GA_Athena_Bush_C.ExecuteUbergraph_GA_Athena_Bush
// 0x0330 (0x0330 - 0x0000)
struct GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable1;                             // 0x0010(0x0020)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0030(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0058(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0080(0x0040)(ContainsInstancedReference)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00E0(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x0140(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue1;            // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData1;                    // 0x0238(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag1;                // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x0270(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1; // 0x0294(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTargetHaveTags_ReturnValue;           // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x02C4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0xC];                                      // 0x02E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_Bush_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush) == 0x000010, "Wrong alignment on GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush");
static_assert(sizeof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush) == 0x000330, "Wrong size on GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, EntryPoint) == 0x000000, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, Temp_struct_Variable) == 0x000004, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, Temp_struct_Variable1) == 0x000010, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_TargetData) == 0x000030, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_ApplicationTag) == 0x000050, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_TargetData2) == 0x000058, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_ApplicationTag2) == 0x000078, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetActorInfo_ReturnValue) == 0x000080, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000D0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D9, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000E0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000100, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_CommitAbility_ReturnValue) == 0x000110, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000118, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CreateDelegate_OutputDelegate1) == 0x000120, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000134, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_MakeStruct_GameplayCueParameters) == 0x000140, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsValid_ReturnValue1) == 0x0001F8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetController_ReturnValue) == 0x000200, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000208, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_bSuccess1) == 0x000210, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsDBNO_ReturnValue) == 0x000211, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_MakeArray_Array) == 0x000218, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_Not_PreBool_ReturnValue) == 0x000228, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_Event_bWasCancelled) == 0x000229, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_CommitAbility_ReturnValue1) == 0x00022A, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_CommitAbility_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsValid_ReturnValue2) == 0x00022B, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetGameState_ReturnValue) == 0x000230, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_TargetData1) == 0x000238, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_TargetData1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_ApplicationTag1) == 0x000258, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_ApplicationTag1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000260, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_bSuccess2) == 0x000268, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x000270, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_HasTag_ReturnValue) == 0x000290, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1) == 0x000294, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_DoesTargetHaveTags_ReturnValue) == 0x00029C, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_DoesTargetHaveTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_Not_PreBool_ReturnValue1) == 0x00029D, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0002A0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002AC, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BreakVector_X) == 0x0002B8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BreakVector_Y) == 0x0002BC, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BreakVector_Z) == 0x0002C0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CreateDelegate_OutputDelegate2) == 0x0002C4, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002D4, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_MakeVector_ReturnValue) == 0x0002D8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_MakeTransform_ReturnValue) == 0x0002F0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000320, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_FinishSpawningActor_ReturnValue) == 0x000328, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Bush_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Bush_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Bush_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Bush_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Bush_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Bush_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Bush_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.Triggered_6FA77BEE4AD5C961BBDC6682C81BD718
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(sizeof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000028, "Wrong size on GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(offsetof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718, TargetData) == 0x000000, "Member 'GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718, ApplicationTag) == 0x000020, "Member 'GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(sizeof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000028, "Wrong size on GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(offsetof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718, TargetData) == 0x000000, "Member 'GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718, ApplicationTag) == 0x000020, "Member 'GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.Completed_6FA77BEE4AD5C961BBDC6682C81BD718
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(sizeof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000028, "Wrong size on GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(offsetof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718, TargetData) == 0x000000, "Member 'GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718, ApplicationTag) == 0x000020, "Member 'GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.K2_CanActivateAbility
// 0x0090 (0x0090 - 0x0000)
struct GA_Athena_Bush_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Bush_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Bush_C_K2_CanActivateAbility) == 0x000090, "Wrong size on GA_Athena_Bush_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Bush_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Bush_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Bush_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Bush_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
