#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_C4_EmptyDetonatorDropResponse

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_C4_EmptyDetonatorDropResponse.GA_Athena_C4_EmptyDetonatorDropResponse_C
// 0x0020 (0x0958 - 0x0938)
class UGA_Athena_C4_EmptyDetonatorDropResponse_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               C4ItemDef;                                         // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TrackedActorTag;                                   // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBetweenExplosions;                            // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentExplosionDelay;                             // 0x0954(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_C4_EmptyDetonatorDropResponse(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_C4_EmptyDetonatorDropResponse_C">();
	}
	static class UGA_Athena_C4_EmptyDetonatorDropResponse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_C4_EmptyDetonatorDropResponse_C>();
	}
};
static_assert(alignof(UGA_Athena_C4_EmptyDetonatorDropResponse_C) == 0x000008, "Wrong alignment on UGA_Athena_C4_EmptyDetonatorDropResponse_C");
static_assert(sizeof(UGA_Athena_C4_EmptyDetonatorDropResponse_C) == 0x000958, "Wrong size on UGA_Athena_C4_EmptyDetonatorDropResponse_C");
static_assert(offsetof(UGA_Athena_C4_EmptyDetonatorDropResponse_C, UberGraphFrame) == 0x000938, "Member 'UGA_Athena_C4_EmptyDetonatorDropResponse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_C4_EmptyDetonatorDropResponse_C, C4ItemDef) == 0x000940, "Member 'UGA_Athena_C4_EmptyDetonatorDropResponse_C::C4ItemDef' has a wrong offset!");
static_assert(offsetof(UGA_Athena_C4_EmptyDetonatorDropResponse_C, TrackedActorTag) == 0x000948, "Member 'UGA_Athena_C4_EmptyDetonatorDropResponse_C::TrackedActorTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_C4_EmptyDetonatorDropResponse_C, DelayBetweenExplosions) == 0x000950, "Member 'UGA_Athena_C4_EmptyDetonatorDropResponse_C::DelayBetweenExplosions' has a wrong offset!");
static_assert(offsetof(UGA_Athena_C4_EmptyDetonatorDropResponse_C, CurrentExplosionDelay) == 0x000954, "Member 'UGA_Athena_C4_EmptyDetonatorDropResponse_C::CurrentExplosionDelay' has a wrong offset!");

}

