#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_FireworksMortar_CountTracker

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_FireworksMortar_CountTracker.GA_FireworksMortar_CountTracker_C
// 0x0020 (0x0958 - 0x0938)
class UGA_FireworksMortar_CountTracker_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         TrackedFireworkHolders;                            // 0x0940(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTag                           T_TrackingGroup;                                   // 0x0950(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_FireworksMortar_CountTracker(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_FireworksMortar_CountTracker_C">();
	}
	static class UGA_FireworksMortar_CountTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_FireworksMortar_CountTracker_C>();
	}
};
static_assert(alignof(UGA_FireworksMortar_CountTracker_C) == 0x000008, "Wrong alignment on UGA_FireworksMortar_CountTracker_C");
static_assert(sizeof(UGA_FireworksMortar_CountTracker_C) == 0x000958, "Wrong size on UGA_FireworksMortar_CountTracker_C");
static_assert(offsetof(UGA_FireworksMortar_CountTracker_C, UberGraphFrame) == 0x000938, "Member 'UGA_FireworksMortar_CountTracker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_FireworksMortar_CountTracker_C, TrackedFireworkHolders) == 0x000940, "Member 'UGA_FireworksMortar_CountTracker_C::TrackedFireworkHolders' has a wrong offset!");
static_assert(offsetof(UGA_FireworksMortar_CountTracker_C, T_TrackingGroup) == 0x000950, "Member 'UGA_FireworksMortar_CountTracker_C::T_TrackingGroup' has a wrong offset!");

}

