#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Melee_GenericHeavyAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function GAB_Melee_GenericHeavyAttack.GAB_Melee_GenericHeavyAttack_C.ExecuteUbergraph_GAB_Melee_GenericHeavyAttack
// 0x0008 (0x0008 - 0x0000)
struct GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack) == 0x000004, "Wrong alignment on GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack");
static_assert(sizeof(GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack) == 0x000008, "Wrong size on GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack");
static_assert(offsetof(GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack, EntryPoint) == 0x000000, "Member 'GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GAB_Melee_GenericHeavyAttack_C_ExecuteUbergraph_GAB_Melee_GenericHeavyAttack::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GAB_Melee_GenericHeavyAttack.GAB_Melee_GenericHeavyAttack_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility");
static_assert(sizeof(GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility");
static_assert(offsetof(GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_Melee_GenericHeavyAttack_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

