#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GolfCartDriver_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function GolfCartDriver_AnimBP.GolfCartDriver_AnimBP_C.ExecuteUbergraph_GolfCartDriver_AnimBP
// 0x0008 (0x0008 - 0x0000)
struct GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP) == 0x000004, "Wrong alignment on GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP");
static_assert(sizeof(GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP) == 0x000008, "Wrong size on GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP");
static_assert(offsetof(GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP, EntryPoint) == 0x000000, "Member 'GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'GolfCartDriver_AnimBP_C_ExecuteUbergraph_GolfCartDriver_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function GolfCartDriver_AnimBP.GolfCartDriver_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'GolfCartDriver_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

