#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Military_M202_Launcher_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Military_M202_Launcher_AnimBP.SK_Military_M202_Launcher_AnimBP_C
// 0x0608 (0x0870 - 0x0268)
class USK_Military_M202_Launcher_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_17CF37A94A2C7AC4053A03A9139BF1E7; // 0x0278(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_E162F90747951BA3BEDA4896DEED9E40; // 0x0298(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_B765535648D151547097BEA864D8C8D4; // 0x02E0(0x0550)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_43CF7C314AA3EFEE15AD1687FA14E458; // 0x0830(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_68F46D374AA96ADBF7D82B82DA19EDA7; // 0x0850(0x0020)()

public:
	void ExecuteUbergraph_SK_Military_M202_Launcher_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Military_M202_Launcher_AnimBP_C">();
	}
	static class USK_Military_M202_Launcher_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Military_M202_Launcher_AnimBP_C>();
	}
};
static_assert(alignof(USK_Military_M202_Launcher_AnimBP_C) == 0x000010, "Wrong alignment on USK_Military_M202_Launcher_AnimBP_C");
static_assert(sizeof(USK_Military_M202_Launcher_AnimBP_C) == 0x000870, "Wrong size on USK_Military_M202_Launcher_AnimBP_C");
static_assert(offsetof(USK_Military_M202_Launcher_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'USK_Military_M202_Launcher_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_Military_M202_Launcher_AnimBP_C, AnimGraphNode_Root_17CF37A94A2C7AC4053A03A9139BF1E7) == 0x000278, "Member 'USK_Military_M202_Launcher_AnimBP_C::AnimGraphNode_Root_17CF37A94A2C7AC4053A03A9139BF1E7' has a wrong offset!");
static_assert(offsetof(USK_Military_M202_Launcher_AnimBP_C, AnimGraphNode_SubInput_E162F90747951BA3BEDA4896DEED9E40) == 0x000298, "Member 'USK_Military_M202_Launcher_AnimBP_C::AnimGraphNode_SubInput_E162F90747951BA3BEDA4896DEED9E40' has a wrong offset!");
static_assert(offsetof(USK_Military_M202_Launcher_AnimBP_C, AnimGraphNode_RigidBody_B765535648D151547097BEA864D8C8D4) == 0x0002E0, "Member 'USK_Military_M202_Launcher_AnimBP_C::AnimGraphNode_RigidBody_B765535648D151547097BEA864D8C8D4' has a wrong offset!");
static_assert(offsetof(USK_Military_M202_Launcher_AnimBP_C, AnimGraphNode_LocalToComponentSpace_43CF7C314AA3EFEE15AD1687FA14E458) == 0x000830, "Member 'USK_Military_M202_Launcher_AnimBP_C::AnimGraphNode_LocalToComponentSpace_43CF7C314AA3EFEE15AD1687FA14E458' has a wrong offset!");
static_assert(offsetof(USK_Military_M202_Launcher_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_68F46D374AA96ADBF7D82B82DA19EDA7) == 0x000850, "Member 'USK_Military_M202_Launcher_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_68F46D374AA96ADBF7D82B82DA19EDA7' has a wrong offset!");

}

