#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP.SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C.ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP
// 0x00F0 (0x00F0 - 0x0000)
struct SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue1;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP) == 0x000008, "Wrong alignment on SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP");
static_assert(sizeof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP) == 0x0000F0, "Wrong size on SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, EntryPoint) == 0x000000, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetOwner_ReturnValue1) == 0x000018, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000030, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, K2Node_DynamicCast_AsCharacter) == 0x000040, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue1) == 0x000050, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetSocketRotation_ReturnValue) == 0x000058, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetUpVector_ReturnValue) == 0x000064, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000070, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_X) == 0x00007C, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_Y) == 0x000080, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_Z) == 0x000084, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_X1) == 0x000088, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_Y1) == 0x00008C, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_Z1) == 0x000090, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_MakeRotator_ReturnValue) == 0x000094, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0000A0, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_ComposeRotators_ReturnValue) == 0x0000A4, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x0000B0, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue1) == 0x0000B4, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000C0, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000CC, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_X2) == 0x0000D8, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_Y2) == 0x0000DC, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_BreakVector_Z2) == 0x0000E0, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E4, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E8, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000EC, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_ExecuteUbergraph_SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP.SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'SK_Weapon_Floatation_Balloon_Rope_Dyn_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

