#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_Chest_Athena.Tiered_Chest_Athena_C
// 0x00A8 (0x0DE8 - 0x0D40)
class ATiered_Chest_Athena_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   S_Chest_SmokeSheet;                                // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   TrasureLight;                                      // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Chest_Ambient_Sound;                               // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x0D60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x0D64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x0D68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D69[0x7];                                      // 0x0D69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584; // 0x0D78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584; // 0x0D7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7D[0x3];                                      // 0x0D7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileOnInteractTL;                                // 0x0D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loot_Effect;                                       // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpecialChestOpenSound;                             // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x0D98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         MobileWiggleAmount;                                // 0x0DA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DAC[0x4];                                      // 0x0DAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ChimeTimer;                                        // 0x0DB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ChestChimeVisualUpdate;                            // 0x0DB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DBC[0x4];                                      // 0x0DBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x0DD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x0DDC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tiered_Chest_Athena(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBeginSearch();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void Chime_Visual();
	void Mobile_OnDisconnect();
	void Mobile_OnInteract();
	void Mobile_Outline_Off();
	void Mobile_Outline_On();
	void OnSetSearched();
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void OnLoot();
	void MobileSelectedTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void MobileOnInteractTL__UpdateFunc();
	void MobileOnInteractTL__FinishedFunc();
	void UserConstructionScript();
	void SetLightVisibility(bool Visible);
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void CreateMobileMIDs();
	void CleanupWiggleMIDs();
	void GetMaxAudibleDistance(float* Max_Distance);
	void SetVisibleMobileInteractIcon(bool Visible);
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_Chest_Athena_C">();
	}
	static class ATiered_Chest_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_Chest_Athena_C>();
	}
};
static_assert(alignof(ATiered_Chest_Athena_C) == 0x000008, "Wrong alignment on ATiered_Chest_Athena_C");
static_assert(sizeof(ATiered_Chest_Athena_C) == 0x000DE8, "Wrong size on ATiered_Chest_Athena_C");
static_assert(offsetof(ATiered_Chest_Athena_C, UberGraphFrame) == 0x000D40, "Member 'ATiered_Chest_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, S_Chest_SmokeSheet) == 0x000D48, "Member 'ATiered_Chest_Athena_C::S_Chest_SmokeSheet' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, TrasureLight) == 0x000D50, "Member 'ATiered_Chest_Athena_C::TrasureLight' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Chest_Ambient_Sound) == 0x000D58, "Member 'ATiered_Chest_Athena_C::Chest_Ambient_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x000D60, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x000D64, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x000D68, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL) == 0x000D70, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584) == 0x000D78, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584) == 0x000D7C, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL) == 0x000D80, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Loot_Effect) == 0x000D88, "Member 'ATiered_Chest_Athena_C::Loot_Effect' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, SpecialChestOpenSound) == 0x000D90, "Member 'ATiered_Chest_Athena_C::SpecialChestOpenSound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MIDs) == 0x000D98, "Member 'ATiered_Chest_Athena_C::MIDs' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileWiggleAmount) == 0x000DA8, "Member 'ATiered_Chest_Athena_C::MobileWiggleAmount' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, ChimeTimer) == 0x000DB0, "Member 'ATiered_Chest_Athena_C::ChimeTimer' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, ChestChimeVisualUpdate) == 0x000DB8, "Member 'ATiered_Chest_Athena_C::ChestChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractionMaterial) == 0x000DC0, "Member 'ATiered_Chest_Athena_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIcon) == 0x000DC8, "Member 'ATiered_Chest_Athena_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIconLocation) == 0x000DD0, "Member 'ATiered_Chest_Athena_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIconScale) == 0x000DDC, "Member 'ATiered_Chest_Athena_C::MobileInteractIconScale' has a wrong offset!");

}

