#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Ice_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Floor_Ice_Athena.Trap_Floor_Ice_Athena_C.ExecuteUbergraph_Trap_Floor_Ice_Athena
// 0x05D0 (0x05D0 - 0x0000)
struct Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0030(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue1;       // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam1;               // 0x00D0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue2;       // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue3;       // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x0190(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0210(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x0290(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x0310(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x0390(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0418(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x04A8(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562[0x6];                                      // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x05A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A6[0x2];                                      // 0x05A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue3;    // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena) == 0x000010, "Wrong alignment on Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena");
static_assert(sizeof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena) == 0x0005D0, "Wrong size on Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, EntryPoint) == 0x000000, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_GetAnimatingMID_ReturnValue) == 0x000008, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_GetAnimatingMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000010, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000020, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam) == 0x000030, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000B0, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Multiply_VectorVector_ReturnValue1) == 0x0000B4, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Multiply_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_BreakVector_X) == 0x0000C0, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_BreakVector_Y) == 0x0000C4, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam1) == 0x0000D0, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000154, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_MakeVector_ReturnValue) == 0x000158, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_MakeVector_ReturnValue1) == 0x000164, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Multiply_VectorVector_ReturnValue2) == 0x000170, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Multiply_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Multiply_VectorVector_ReturnValue3) == 0x00017C, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Multiply_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam2) == 0x000190, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam3) == 0x000210, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam4) == 0x000290, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam5) == 0x000310, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeStruct_ParticleSysParam6) == 0x000390, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000410, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_MakeArray_Array) == 0x000418, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000428, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00042C, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000438, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, Temp_bool_IsClosed_Variable) == 0x000440, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_IsValid_ReturnValue) == 0x000441, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_GetCameraLocation_ReturnValue) == 0x000444, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000450, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00045C, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000468, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000470, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000480, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000488, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000494, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_GameplayCueEvent_EventType) == 0x0004A0, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_GameplayCueEvent_Parameters) == 0x0004A8, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x000560, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_IsValid_ReturnValue1) == 0x000561, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000568, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x000570, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00057C, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_VSize_ReturnValue) == 0x000588, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x00058C, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Conv_LinearColorToVector_ReturnValue1) == 0x000598, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Conv_LinearColorToVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_IsValid_ReturnValue2) == 0x0005A4, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x0005A5, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x0005A8, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_Conv_LinearColorToVector_ReturnValue3) == 0x0005B4, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_Conv_LinearColorToVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, Temp_float_Variable) == 0x0005C0, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0005C4, "Member 'Trap_Floor_Ice_Athena_C_ExecuteUbergraph_Trap_Floor_Ice_Athena::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Ice_Athena.Trap_Floor_Ice_Athena_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Floor_Ice_Athena_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Ice_Athena.Trap_Floor_Ice_Athena_C.SetTeamColor
// 0x0048 (0x0048 - 0x0000)
struct Trap_Floor_Ice_Athena_C_SetTeamColor final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Ice_Athena_C_SetTeamColor) == 0x000008, "Wrong alignment on Trap_Floor_Ice_Athena_C_SetTeamColor");
static_assert(sizeof(Trap_Floor_Ice_Athena_C_SetTeamColor) == 0x000048, "Wrong size on Trap_Floor_Ice_Athena_C_SetTeamColor");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_SetTeamColor, CallFunc_GetAnimatingMID_ReturnValue) == 0x000000, "Member 'Trap_Floor_Ice_Athena_C_SetTeamColor::CallFunc_GetAnimatingMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_SetTeamColor, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000008, "Member 'Trap_Floor_Ice_Athena_C_SetTeamColor::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Ice_Athena_C_SetTeamColor, CallFunc_GetSubGame_ReturnValue) == 0x000018, "Member 'Trap_Floor_Ice_Athena_C_SetTeamColor::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
