#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamMemberButton.AthenaTeamMemberButton_C.ExecuteUbergraph_AthenaTeamMemberButton
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0050(0x0018)()
	EFortFriendRequestStatus                      Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowExternalFriendsUI_ReturnValue;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortFriendRequestStatus                      Temp_byte_Variable1;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialPanel_C*                         K2Node_DynamicCast_AsSocial_Panel;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue1;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortFriendRequestStatus                      K2Node_Event_RequestStatus;                        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0018)()
	bool                                          K2Node_Select1_Default;                            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton) == 0x000008, "Wrong alignment on AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton");
static_assert(sizeof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton) == 0x0000E8, "Wrong size on AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, EntryPoint) == 0x000000, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_text_Variable) == 0x000008, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_text_Variable1) == 0x000020, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_text_Variable2) == 0x000038, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_text_Variable3) == 0x000050, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_byte_Variable) == 0x000068, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_bool_Variable) == 0x000069, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_bool_Variable1) == 0x00006A, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_bool_Variable2) == 0x00006B, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_bool_Variable3) == 0x00006C, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, CallFunc_GetContext_ReturnValue) == 0x000070, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, CallFunc_ShouldShowExternalFriendsUI_ReturnValue) == 0x000078, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::CallFunc_ShouldShowExternalFriendsUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000080, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, CallFunc_GetCachedWidget_ReturnValue) == 0x000088, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, Temp_byte_Variable1) == 0x000090, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_DynamicCast_AsSocial_Panel) == 0x000098, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_DynamicCast_AsSocial_Panel' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_DynamicCast_AsIcon_Text_Button) == 0x0000A8, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_DynamicCast_bSuccess1) == 0x0000B0, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, CallFunc_GetContext_ReturnValue1) == 0x0000B8, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_Event_RequestStatus) == 0x0000C0, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_Event_RequestStatus' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_Select_Default) == 0x0000C8, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton, K2Node_Select1_Default) == 0x0000E0, "Member 'AthenaTeamMemberButton_C_ExecuteUbergraph_AthenaTeamMemberButton::K2Node_Select1_Default' has a wrong offset!");

// Function AthenaTeamMemberButton.AthenaTeamMemberButton_C.OnFriendshipStatusDetermined
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberButton_C_OnFriendshipStatusDetermined final
{
public:
	EFortFriendRequestStatus                      RequestStatus;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberButton_C_OnFriendshipStatusDetermined) == 0x000001, "Wrong alignment on AthenaTeamMemberButton_C_OnFriendshipStatusDetermined");
static_assert(sizeof(AthenaTeamMemberButton_C_OnFriendshipStatusDetermined) == 0x000001, "Wrong size on AthenaTeamMemberButton_C_OnFriendshipStatusDetermined");
static_assert(offsetof(AthenaTeamMemberButton_C_OnFriendshipStatusDetermined, RequestStatus) == 0x000000, "Member 'AthenaTeamMemberButton_C_OnFriendshipStatusDetermined::RequestStatus' has a wrong offset!");

}

