#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_LMG_SAW_Athena

#include "Basic.hpp"

#include "B_Assault_Bulletswarm_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Assault_LMG_SAW_Athena.B_Assault_LMG_SAW_Athena_C
// 0x0020 (0x0E08 - 0x0DE8)
class AB_Assault_LMG_SAW_Athena_C final : public AB_Assault_Bulletswarm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_LMG_SAW_Athena_C;         // 0x0DE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                LaserScaleUntargeted;                              // 0x0DF0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaserScaleTargeted;                                // 0x0DFC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Assault_LMG_SAW_Athena(int32 EntryPoint);
	void OnSetTargeting(bool bNewIsTargeting);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Assault_LMG_SAW_Athena_C">();
	}
	static class AB_Assault_LMG_SAW_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_LMG_SAW_Athena_C>();
	}
};
static_assert(alignof(AB_Assault_LMG_SAW_Athena_C) == 0x000008, "Wrong alignment on AB_Assault_LMG_SAW_Athena_C");
static_assert(sizeof(AB_Assault_LMG_SAW_Athena_C) == 0x000E08, "Wrong size on AB_Assault_LMG_SAW_Athena_C");
static_assert(offsetof(AB_Assault_LMG_SAW_Athena_C, UberGraphFrame_B_Assault_LMG_SAW_Athena_C) == 0x000DE8, "Member 'AB_Assault_LMG_SAW_Athena_C::UberGraphFrame_B_Assault_LMG_SAW_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Assault_LMG_SAW_Athena_C, LaserScaleUntargeted) == 0x000DF0, "Member 'AB_Assault_LMG_SAW_Athena_C::LaserScaleUntargeted' has a wrong offset!");
static_assert(offsetof(AB_Assault_LMG_SAW_Athena_C, LaserScaleTargeted) == 0x000DFC, "Member 'AB_Assault_LMG_SAW_Athena_C::LaserScaleTargeted' has a wrong offset!");

}

