#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_Athena_C4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_BGA_Athena_C4.B_BGA_Athena_C4_C.ExecuteUbergraph_B_BGA_Athena_C4
// 0x0A20 (0x0A20 - 0x0000)
struct B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_CustomEvent_DamageOwner;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Explosion_Level;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Activation_Radius;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor1;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage1;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy1;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser1;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation1;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent1;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName1;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum1;                      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x00D0(0x00A8)()
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x01B8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_CustomEvent_Init_Speed;                     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Gravity;                        // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Activation_Delay;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor1;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4;              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DelayForChainExplode;           // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue1;               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage2;                              // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags2;                          // 0x03B0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum2;                            // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo2;                             // 0x03DC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy2;                        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser2;                        // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext2;                       // 0x0478(0x0018)()
	float                                         K2Node_Event_Damage1;                              // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags1;                          // 0x0498(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum1;                            // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo1;                             // 0x04C4(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy1;                        // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser1;                        // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext1;                       // 0x0560(0x0018)()
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena1;     // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0590(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x05BC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0658(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0680(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData1;              // 0x0698(0x00A8)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue1;                  // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0754(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0760(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array1;                           // 0x0778(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0788(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79A[0x2];                                      // 0x079A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate1;             // 0x079C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate2;             // 0x07AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate3;             // 0x07BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate4;             // 0x07CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DD[0x3];                                      // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x07E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x07EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ED[0x3];                                      // 0x07ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x07F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x07FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FE[0x2];                                      // 0x07FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData2;              // 0x0800(0x00A8)()
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x08A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AA[0x6];                                      // 0x08AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array2;                           // 0x08B0(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue1;                // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x08C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C2[0x6];                                      // 0x08C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x08D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x08E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x08E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x08F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0900(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x090C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x090D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90E[0x2];                                      // 0x090E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0910(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91C[0x4];                                      // 0x091C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x0920(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0928(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0938(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0954(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0960(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x096C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x09F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0A01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A02[0x6];                                      // 0x0A02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4) == 0x000008, "Wrong alignment on B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4");
static_assert(sizeof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4) == 0x000A20, "Wrong size on B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, EntryPoint) == 0x000000, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DamageOwner) == 0x000018, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DamageOwner' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_GetInstigator_ReturnValue) == 0x000028, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_Array_Get_Item) == 0x000030, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_GetActorTeam_ReturnValue) == 0x000038, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_AsBuilding_Actor) == 0x000040, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Explosion_Level) == 0x00004C, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Explosion_Level' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Activation_Radius) == 0x000050, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Activation_Radius' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_PlayerPawn) == 0x000058, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, Temp_struct_Variable) == 0x000060, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DamagedActor1) == 0x000070, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DamagedActor1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Damage1) == 0x000078, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Damage1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_InstigatedBy1) == 0x000080, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_InstigatedBy1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DamageCauser1) == 0x000088, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_HitLocation1) == 0x000090, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_HitLocation1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_FHitComponent1) == 0x0000A0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_FHitComponent1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_BoneName1) == 0x0000A8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_BoneName1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Momentum1) == 0x0000B0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Momentum1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DestroyedActor) == 0x0000C0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_IsValid_ReturnValue1) == 0x0000C8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000C9, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_HasAuthority_ReturnValue1) == 0x0000CA, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_MakeStruct_GameplayEventData) == 0x0000D0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_MyComp) == 0x000178, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Other) == 0x000180, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_OtherComp) == 0x000188, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_bSelfMoved) == 0x000190, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_HitLocation) == 0x000194, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_HitNormal) == 0x0001A0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_NormalImpulse) == 0x0001AC, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Hit) == 0x0001B8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Init_Speed) == 0x000240, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Init_Speed' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Gravity) == 0x000244, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Gravity' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Activation_Delay) == 0x000248, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Activation_Delay' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_bBlockingHit) == 0x00024C, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_bInitialOverlap) == 0x00024D, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_Time) == 0x000250, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_Distance) == 0x000254, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_Location) == 0x000258, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_ImpactPoint) == 0x000264, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_Normal) == 0x000270, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_ImpactNormal) == 0x00027C, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_PhysMat) == 0x000288, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_HitActor) == 0x000290, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_HitComponent) == 0x000298, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_HitBoneName) == 0x0002A0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_HitItem) == 0x0002A8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_FaceIndex) == 0x0002AC, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_TraceStart) == 0x0002B0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_BreakHitResult_TraceEnd) == 0x0002BC, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_ComponentHasTag_ReturnValue) == 0x0002C8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_AsBuilding_Actor1) == 0x0002D0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_AsBuilding_Actor1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_bSuccess1) == 0x0002D8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_AsB_BGA_Athena_C4) == 0x0002E0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_AsB_BGA_Athena_C4' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_bSuccess2) == 0x0002E8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_AsPawn) == 0x0002F0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_bSuccess3) == 0x0002F8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DelayForChainExplode) == 0x0002FC, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DelayForChainExplode' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000300, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00030C, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000318, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_GetInstigator_ReturnValue1) == 0x000320, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_GetInstigator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000328, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000338, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_bSuccess4) == 0x000340, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DamagedActor) == 0x000348, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Damage) == 0x000350, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_InstigatedBy) == 0x000358, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_DamageCauser) == 0x000360, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_HitLocation) == 0x000368, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_FHitComponent) == 0x000378, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_BoneName) == 0x000380, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_CustomEvent_Momentum) == 0x000388, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_MakeRotFromX_ReturnValue) == 0x000394, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0003A0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Damage2) == 0x0003A8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_DamageTags2) == 0x0003B0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_DamageTags2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Momentum2) == 0x0003D0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Momentum2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_HitInfo2) == 0x0003DC, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_HitInfo2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_InstigatedBy2) == 0x000468, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_InstigatedBy2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_DamageCauser2) == 0x000470, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_DamageCauser2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_EffectContext2) == 0x000478, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_EffectContext2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Damage1) == 0x000490, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Damage1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_DamageTags1) == 0x000498, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_DamageTags1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Momentum1) == 0x0004B8, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Momentum1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_HitInfo1) == 0x0004C4, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_HitInfo1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_InstigatedBy1) == 0x000550, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_InstigatedBy1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_DamageCauser1) == 0x000558, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_DamageCauser1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_EffectContext1) == 0x000560, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_EffectContext1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, CallFunc_K2_GetPawn_ReturnValue) == 0x000578, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_AsFort_Player_Pawn_Athena1) == 0x000580, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_AsFort_Player_Pawn_Athena1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_DynamicCast_bSuccess5) == 0x000588, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Damage) == 0x00058C, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_DamageTags) == 0x000590, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_Momentum) == 0x0005B0, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_HitInfo) == 0x0005BC, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4, K2Node_Event_InstigatedBy) == 0x000648, "Member 'B_BGA_Athena_C4_C_ExecuteUbergraph_B_BGA_Athena_C4::K2Node_Event_InstigatedBy' has a wrong offset!");
