#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PlayerSpawnedBall

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsBall_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_PlayerSpawnedBall.B_PlayerSpawnedBall_C
// 0x0030 (0x08A8 - 0x0878)
class AB_PlayerSpawnedBall_C final : public APhysicsBall_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_PlayerSpawnedBall_C;              // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ImpactFX_0;                                        // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CueToPlayWhenReused;                               // 0x0888(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CueToPlayWhenExpired;                              // 0x0890(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         BounceCount_0;                                     // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFrontEndPreview;                                // 0x089C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89D[0x3];                                      // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        OwningPawn;                                        // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_PlayerSpawnedBall(int32 EntryPoint);
	void InitializeToyPreviewInFrontend();
	void InitializeToyInstance(class AFortPlayerController* OwningPC, int32 NumTimesSummoned);
	void StartToyFadeOutDueToNewPlacement();
	void NotifyToyInstanceOfReuse();
	void UserConstructionScript();
	void PlayCueCenteredOnMe(const struct FGameplayTag& GameplayCueToPlay, float Raw_Magnitude);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_PlayerSpawnedBall_C">();
	}
	static class AB_PlayerSpawnedBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_PlayerSpawnedBall_C>();
	}
};
static_assert(alignof(AB_PlayerSpawnedBall_C) == 0x000008, "Wrong alignment on AB_PlayerSpawnedBall_C");
static_assert(sizeof(AB_PlayerSpawnedBall_C) == 0x0008A8, "Wrong size on AB_PlayerSpawnedBall_C");
static_assert(offsetof(AB_PlayerSpawnedBall_C, UberGraphFrame_B_PlayerSpawnedBall_C) == 0x000878, "Member 'AB_PlayerSpawnedBall_C::UberGraphFrame_B_PlayerSpawnedBall_C' has a wrong offset!");
static_assert(offsetof(AB_PlayerSpawnedBall_C, ImpactFX_0) == 0x000880, "Member 'AB_PlayerSpawnedBall_C::ImpactFX_0' has a wrong offset!");
static_assert(offsetof(AB_PlayerSpawnedBall_C, CueToPlayWhenReused) == 0x000888, "Member 'AB_PlayerSpawnedBall_C::CueToPlayWhenReused' has a wrong offset!");
static_assert(offsetof(AB_PlayerSpawnedBall_C, CueToPlayWhenExpired) == 0x000890, "Member 'AB_PlayerSpawnedBall_C::CueToPlayWhenExpired' has a wrong offset!");
static_assert(offsetof(AB_PlayerSpawnedBall_C, BounceCount_0) == 0x000898, "Member 'AB_PlayerSpawnedBall_C::BounceCount_0' has a wrong offset!");
static_assert(offsetof(AB_PlayerSpawnedBall_C, bIsFrontEndPreview) == 0x00089C, "Member 'AB_PlayerSpawnedBall_C::bIsFrontEndPreview' has a wrong offset!");
static_assert(offsetof(AB_PlayerSpawnedBall_C, OwningPawn) == 0x0008A0, "Member 'AB_PlayerSpawnedBall_C::OwningPawn' has a wrong offset!");

}

