#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_Ferret_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_Ferret_Athena.B_Prj_Ranged_Ferret_Athena_C
// 0x0120 (0x0960 - 0x0840)
class AB_Prj_Ranged_Ferret_Athena_C final : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               RocketTrail;                                       // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Ribbon_Trail_PSC;                                  // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Water_Explosion_PSC;                               // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Ribbon_Trail_PS;                                   // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Water_Explosion_PS;                                // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Generic_PS;                              // 0x0878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Generic_PSC;                             // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Projectile_Explosion_Sound;                        // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StopLocation;                                      // 0x0890(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StopRotZ;                                          // 0x08A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TrailLifetime;                                     // 0x08B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Flesh_Damage_PSC;                        // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Projectile_Explosion_Water_Sound;                  // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RocketTrailPS;                                     // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Delta;                                        // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RocketSpinRate;                                    // 0x08D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Explosion_Impact_Offset;                           // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RocketSpin;                                        // 0x08DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RocketScale;                                       // 0x08E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerMaxReached_;                                  // 0x08F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F5[0x3];                                      // 0x08F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Ground_Decal;                                      // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Ground_Decal_MID;                                  // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Max;                                    // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Min;                                    // 0x090C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Rocket_Trail_Template;                             // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Explosion_PS;                                      // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackNear;                        // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackFar;                         // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DoDirectDamageToBiplanes_;                         // 0x0940(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Prj_Ranged_Ferret_Athena(int32 EntryPoint);
	void CustomExploded();
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveDestroyed();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void FuseTimerMax();
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_Ferret_Athena_C">();
	}
	static class AB_Prj_Ranged_Ferret_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_Ferret_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_Ferret_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Ranged_Ferret_Athena_C");
static_assert(sizeof(AB_Prj_Ranged_Ferret_Athena_C) == 0x000960, "Wrong size on AB_Prj_Ranged_Ferret_Athena_C");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, UberGraphFrame) == 0x000840, "Member 'AB_Prj_Ranged_Ferret_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, RocketTrail) == 0x000848, "Member 'AB_Prj_Ranged_Ferret_Athena_C::RocketTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Mesh) == 0x000850, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Ribbon_Trail_PSC) == 0x000858, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Ribbon_Trail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Water_Explosion_PSC) == 0x000860, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Water_Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Ribbon_Trail_PS) == 0x000868, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Ribbon_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Water_Explosion_PS) == 0x000870, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Water_Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Explosion_Generic_PS) == 0x000878, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Explosion_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Explosion_Generic_PSC) == 0x000880, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Explosion_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Projectile_Explosion_Sound) == 0x000888, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Projectile_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, StopLocation) == 0x000890, "Member 'AB_Prj_Ranged_Ferret_Athena_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Explosion_Flesh_Damage_PS) == 0x0008A0, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, StopRotZ) == 0x0008A8, "Member 'AB_Prj_Ranged_Ferret_Athena_C::StopRotZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, TrailLifetime) == 0x0008B4, "Member 'AB_Prj_Ranged_Ferret_Athena_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Explosion_Flesh_Damage_PSC) == 0x0008B8, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Explosion_Flesh_Damage_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Projectile_Explosion_Water_Sound) == 0x0008C0, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Projectile_Explosion_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, RocketTrailPS) == 0x0008C8, "Member 'AB_Prj_Ranged_Ferret_Athena_C::RocketTrailPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Tick_Delta) == 0x0008D0, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Tick_Delta' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, RocketSpinRate) == 0x0008D4, "Member 'AB_Prj_Ranged_Ferret_Athena_C::RocketSpinRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Explosion_Impact_Offset) == 0x0008D8, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Explosion_Impact_Offset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, RocketSpin) == 0x0008DC, "Member 'AB_Prj_Ranged_Ferret_Athena_C::RocketSpin' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, RocketScale) == 0x0008E8, "Member 'AB_Prj_Ranged_Ferret_Athena_C::RocketScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, TimerMaxReached_) == 0x0008F4, "Member 'AB_Prj_Ranged_Ferret_Athena_C::TimerMaxReached_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Ground_Decal) == 0x0008F8, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Ground_Decal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Ground_Decal_MID) == 0x000900, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Ground_Decal_MID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Decal_Size_Max) == 0x000908, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Decal_Size_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Decal_Size_Min) == 0x00090C, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Decal_Size_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Rocket_Trail_Template) == 0x000910, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Rocket_Trail_Template' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, SurfaceType) == 0x000918, "Member 'AB_Prj_Ranged_Ferret_Athena_C::SurfaceType' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, Explosion_PS) == 0x000920, "Member 'AB_Prj_Ranged_Ferret_Athena_C::Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, ExplosionForceFeedbackNear) == 0x000928, "Member 'AB_Prj_Ranged_Ferret_Athena_C::ExplosionForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, ExplosionForceFeedbackFar) == 0x000930, "Member 'AB_Prj_Ranged_Ferret_Athena_C::ExplosionForceFeedbackFar' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, PlayerPawn) == 0x000938, "Member 'AB_Prj_Ranged_Ferret_Athena_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Ferret_Athena_C, DoDirectDamageToBiplanes_) == 0x000940, "Member 'AB_Prj_Ranged_Ferret_Athena_C::DoDirectDamageToBiplanes_' has a wrong offset!");

}

