#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Bullet_Sniper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Bullet_Sniper.B_Prj_Bullet_Sniper_C.ExecuteUbergraph_B_Prj_Bullet_Sniper
// 0x0140 (0x0140 - 0x0000)
struct B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0004(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper) == 0x000008, "Wrong alignment on B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper");
static_assert(sizeof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper) == 0x000140, "Wrong size on B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, EntryPoint) == 0x000000, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, K2Node_Event_Hit) == 0x000004, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_bBlockingHit) == 0x00008C, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_bInitialOverlap) == 0x00008D, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_Time) == 0x000090, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_Distance) == 0x000094, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_Location) == 0x000098, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_ImpactPoint) == 0x0000A4, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_Normal) == 0x0000B0, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_ImpactNormal) == 0x0000BC, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_PhysMat) == 0x0000C8, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_HitActor) == 0x0000D0, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_HitComponent) == 0x0000D8, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_HitBoneName) == 0x0000E0, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_HitItem) == 0x0000E8, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_FaceIndex) == 0x0000EC, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_TraceStart) == 0x0000F0, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BreakHitResult_TraceEnd) == 0x0000FC, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, K2Node_DynamicCast_AsFort_Pawn) == 0x000108, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000114, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000120, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_IsDedicatedServer_ReturnValue) == 0x00012C, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_IsMobilePlatform_ReturnValue) == 0x00012D, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, Temp_bool_Variable) == 0x00012E, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_BooleanOR_ReturnValue) == 0x00012F, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, K2Node_Select_Default) == 0x000130, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000138, "Member 'B_Prj_Bullet_Sniper_C_ExecuteUbergraph_B_Prj_Bullet_Sniper::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");

// Function B_Prj_Bullet_Sniper.B_Prj_Bullet_Sniper_C.OnStop
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Bullet_Sniper_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Bullet_Sniper_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Bullet_Sniper_C_OnStop");
static_assert(sizeof(B_Prj_Bullet_Sniper_C_OnStop) == 0x000088, "Wrong size on B_Prj_Bullet_Sniper_C_OnStop");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Bullet_Sniper_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Bullet_Sniper.B_Prj_Bullet_Sniper_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Bullet_Sniper_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Bullet_Sniper_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Prj_Bullet_Sniper_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Bullet_Sniper_C_UserConstructionScript) == 0x000004, "Wrong size on B_Prj_Bullet_Sniper_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Bullet_Sniper_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'B_Prj_Bullet_Sniper_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

}

