#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Hook_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ToyAngleSelectorInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Hook_Athena.B_Prj_Hook_Athena_C.ExecuteUbergraph_B_Prj_Hook_Athena
// 0x0680 (0x0680 - 0x0000)
struct B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate1;             // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable1;                               // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName1;                    // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Hookgun_Athena_C*                    K2Node_DynamicCast_AsB_Hookgun_Athena;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0xF];                                      // 0x0181(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x01C8(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBaseAimPitchQuantized_ReturnValue;     // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HookGunRope_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     CallFunc_GetVehicle_ReturnValue;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue1;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CallFunc_GetVehicle_ReturnValue1;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle;   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickGrappleMontage_SectionName;           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x029C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0308(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_HandleHits_Target;                        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0418(0x00A8)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData1;              // 0x04C0(0x00A8)()
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue1; // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x057C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HandleLaunch_JumpPadding_;                // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleLaunch_JumpPadding_1;               // 0x058D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x058E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F[0x1];                                      // 0x058F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CallFunc_GetVehicle_ReturnValue2;                  // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle1;  // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x05BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x05C4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName14;                   // 0x05D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInfiniteAmmo_ReturnValue;              // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x05DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DF[0x1];                                      // 0x05DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate15;            // 0x05E0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Select1_Default;                            // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity; // 0x05F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue; // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity1; // 0x0624(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue1; // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select3_Default;                            // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity2; // 0x064C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue2; // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select4_Default;                            // 0x065C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select5_Default;                            // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x066C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZiplining_ReturnValue;                  // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena) == 0x000010, "Wrong alignment on B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena");
static_assert(sizeof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena) == 0x000680, "Wrong size on B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, EntryPoint) == 0x000000, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName11) == 0x000004, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName10) == 0x00001C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate1) == 0x000024, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_name_Variable) == 0x000034, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate2) == 0x00003C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName9) == 0x00004C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName8) == 0x000054, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate3) == 0x00005C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName7) == 0x00006C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate4) == 0x000074, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName6) == 0x000084, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate5) == 0x00008C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName5) == 0x00009C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate6) == 0x0000A4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_name_Variable1) == 0x0000B4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable) == 0x0000BC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable1) == 0x0000BD, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable2) == 0x0000BE, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable3) == 0x0000BF, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable4) == 0x0000C0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable5) == 0x0000C1, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName4) == 0x0000C4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate7) == 0x0000CC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName3) == 0x0000DC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate8) == 0x0000E4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName2) == 0x0000F4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate9) == 0x0000FC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName1) == 0x00010C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate10) == 0x000114, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName) == 0x000124, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate11) == 0x00012C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_name_Variable2) == 0x00013C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000148, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_HitLocation) == 0x000154, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000160, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetOwner_ReturnValue) == 0x000170, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsB_Hookgun_Athena) == 0x000178, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsB_Hookgun_Athena' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess1) == 0x000180, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001C0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_MakeStruct_GameplayEffectContextHandle) == 0x0001C8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_MakeStruct_GameplayEffectContextHandle' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001E0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001E8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0001EC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001F8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsInVehicle_ReturnValue) == 0x000201, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetBaseAimPitchQuantized_ReturnValue) == 0x000204, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetBaseAimPitchQuantized_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000208, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_FinishSpawningActor_ReturnValue) == 0x000210, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000218, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetInstigatorController_ReturnValue) == 0x000228, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue1) == 0x000230, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BooleanAND_ReturnValue) == 0x000231, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000234, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000240, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName12) == 0x000248, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetVehicle_ReturnValue) == 0x000250, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsInVehicle_ReturnValue1) == 0x000258, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsInVehicle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetVehicle_ReturnValue1) == 0x000260, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetVehicle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000268, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle) == 0x000270, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess2) == 0x000278, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue2) == 0x000279, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1) == 0x000280, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_PickGrappleMontage_SectionName) == 0x000288, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_PickGrappleMontage_SectionName' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2) == 0x000290, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue3) == 0x000298, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue4) == 0x000299, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate12) == 0x00029C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_SetTimer_ReturnValue) == 0x0002B0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002B8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x0002B9, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002BA, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Select_Default) == 0x0002C0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_MyComp) == 0x0002C8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_Other) == 0x0002D0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_OtherComp) == 0x0002D8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_bSelfMoved) == 0x0002E0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_HitLocation) == 0x0002E4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_HitNormal) == 0x0002F0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_NormalImpulse) == 0x0002FC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_Event_Hit) == 0x000308, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_HandleHits_Target) == 0x000390, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_HandleHits_Target' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_bBlockingHit) == 0x000398, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_bInitialOverlap) == 0x000399, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_Time) == 0x00039C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_Distance) == 0x0003A0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_Location) == 0x0003A4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_ImpactPoint) == 0x0003B0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_Normal) == 0x0003BC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_ImpactNormal) == 0x0003C8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_PhysMat) == 0x0003D8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_HitActor) == 0x0003E0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_HitComponent) == 0x0003E8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_HitBoneName) == 0x0003F0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_HitItem) == 0x0003F8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_FaceIndex) == 0x0003FC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_TraceStart) == 0x000400, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BreakHitResult_TraceEnd) == 0x00040C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_MakeStruct_GameplayEventData) == 0x000418, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_MakeStruct_GameplayEventData1) == 0x0004C0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_MakeStruct_GameplayEventData1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetFortPlayerControllerFromActor_ReturnValue1) == 0x000568, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetFortPlayerControllerFromActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000570, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess3) == 0x000578, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate13) == 0x00057C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_HandleLaunch_JumpPadding_) == 0x00058C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_HandleLaunch_JumpPadding_' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_HandleLaunch_JumpPadding_1) == 0x00058D, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_HandleLaunch_JumpPadding_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00058E, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetVehicle_ReturnValue2) == 0x000590, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetVehicle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle1) == 0x000598, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess4) == 0x0005A0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x0005A4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetVehicleVelocity_ReturnValue) == 0x0005B0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetVehicleVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName13) == 0x0005BC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName13' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate14) == 0x0005C4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
