#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_BoomBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_BoomBox.BGA_Athena_BoomBox_C
// 0x0040 (0x07A8 - 0x0768)
class ABGA_Athena_BoomBox_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Death_Size_C11F3C1E4609F655C142AF852796668C;       // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Death__Direction_C11F3C1E4609F655C142AF852796668C; // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Death;                                             // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AttachParent;                                      // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          b_BeatStarted;                                     // 0x07A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BGA_Athena_BoomBox(int32 EntryPoint);
	void SpawnDeathFX();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BoundEvents();
	void Death__FinishedFunc();
	void Death__SpawnDeathFX__EventFunc();
	void Death__UpdateFunc();
	void DestroySelf(class AActor* DestroyedActor);
	void OnRep_b_BeatStarted();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_BoomBox_C">();
	}
	static class ABGA_Athena_BoomBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_BoomBox_C>();
	}
};
static_assert(alignof(ABGA_Athena_BoomBox_C) == 0x000008, "Wrong alignment on ABGA_Athena_BoomBox_C");
static_assert(sizeof(ABGA_Athena_BoomBox_C) == 0x0007A8, "Wrong size on ABGA_Athena_BoomBox_C");
static_assert(offsetof(ABGA_Athena_BoomBox_C, UberGraphFrame) == 0x000768, "Member 'ABGA_Athena_BoomBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, Box) == 0x000770, "Member 'ABGA_Athena_BoomBox_C::Box' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, SkeletalMesh) == 0x000778, "Member 'ABGA_Athena_BoomBox_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, DefaultSceneRoot) == 0x000780, "Member 'ABGA_Athena_BoomBox_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, Death_Size_C11F3C1E4609F655C142AF852796668C) == 0x000788, "Member 'ABGA_Athena_BoomBox_C::Death_Size_C11F3C1E4609F655C142AF852796668C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, Death__Direction_C11F3C1E4609F655C142AF852796668C) == 0x00078C, "Member 'ABGA_Athena_BoomBox_C::Death__Direction_C11F3C1E4609F655C142AF852796668C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, Death) == 0x000790, "Member 'ABGA_Athena_BoomBox_C::Death' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, AttachParent) == 0x000798, "Member 'ABGA_Athena_BoomBox_C::AttachParent' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BoomBox_C, b_BeatStarted) == 0x0007A0, "Member 'ABGA_Athena_BoomBox_C::b_BeatStarted' has a wrong offset!");

}

