#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Cube_Area_Effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.ExecuteUbergraph_BGA_Cube_Area_Effect
// 0x0160 (0x0160 - 0x0000)
struct BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle1;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACUBE_C*                                K2Node_DynamicCast_AsCUBE;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect) == 0x000008, "Wrong alignment on BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect");
static_assert(sizeof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect) == 0x000160, "Wrong size on BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, EntryPoint) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000018, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000020, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_ComponentBoundEvent_OtherActor) == 0x000028, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_ComponentBoundEvent_OtherComp) == 0x000030, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000038, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_Event_OtherActor) == 0x0000C8, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x0000D0, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_AsFort_Athena_Vehicle1) == 0x0000E0, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_AsFort_Athena_Vehicle1' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_bSuccess1) == 0x0000E8, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000F0, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_AsFort_Player_Pawn1) == 0x000100, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_AsFort_Player_Pawn1' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_bSuccess3) == 0x000108, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000110, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000118, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_CreateDelegate_OutputDelegate1) == 0x000120, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_Add_ByteByte_ReturnValue) == 0x000130, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_AsCUBE) == 0x000140, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_AsCUBE' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, K2Node_DynamicCast_bSuccess4) == 0x000148, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000149, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_GetContext_ReturnValue) == 0x000150, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect, CallFunc_HasAuthority_ReturnValue) == 0x000159, "Member 'BGA_Cube_Area_Effect_C_ExecuteUbergraph_BGA_Cube_Area_Effect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap");
static_assert(sizeof(BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap");
static_assert(offsetof(BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.BndEvt__Effect Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_Cube_Area_Effect_C_BndEvt__Effect_Area_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.UserConstructionScript
// 0x001C (0x001C - 0x0000)
struct BGA_Cube_Area_Effect_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue1;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_Cube_Area_Effect_C_UserConstructionScript");
static_assert(sizeof(BGA_Cube_Area_Effect_C_UserConstructionScript) == 0x00001C, "Wrong size on BGA_Cube_Area_Effect_C_UserConstructionScript");
static_assert(offsetof(BGA_Cube_Area_Effect_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000004, "Member 'BGA_Cube_Area_Effect_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue1) == 0x000010, "Member 'BGA_Cube_Area_Effect_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue1' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.SetRuneMaterial
// 0x0050 (0x0050 - 0x0000)
struct BGA_Cube_Area_Effect_C_SetRuneMaterial final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable4;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable5;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable6;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_SetRuneMaterial) == 0x000008, "Wrong alignment on BGA_Cube_Area_Effect_C_SetRuneMaterial");
static_assert(sizeof(BGA_Cube_Area_Effect_C_SetRuneMaterial) == 0x000050, "Wrong size on BGA_Cube_Area_Effect_C_SetRuneMaterial");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_int_Variable) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable) == 0x000008, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable1) == 0x000010, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable2) == 0x000018, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable3) == 0x000020, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable4) == 0x000028, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable5) == 0x000030, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, Temp_object_Variable6) == 0x000038, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_SetRuneMaterial, K2Node_Select_Default) == 0x000048, "Member 'BGA_Cube_Area_Effect_C_SetRuneMaterial::K2Node_Select_Default' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.OnRep_RuneIndex
// 0x0140 (0x0140 - 0x0000)
struct BGA_Cube_Area_Effect_C_OnRep_RuneIndex final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACUBE_C*                                K2Node_DynamicCast_AsCUBE;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex) == 0x000010, "Wrong alignment on BGA_Cube_Area_Effect_C_OnRep_RuneIndex");
static_assert(sizeof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex) == 0x000140, "Wrong size on BGA_Cube_Area_Effect_C_OnRep_RuneIndex");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, K2Node_DynamicCast_AsCUBE) == 0x000010, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::K2Node_DynamicCast_AsCUBE' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_RuneIndex, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000B0, "Member 'BGA_Cube_Area_Effect_C_OnRep_RuneIndex::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.OnRep_EnableRuneAmbientEffect
// 0x0001 (0x0001 - 0x0000)
struct BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect) == 0x000001, "Wrong alignment on BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect");
static_assert(sizeof(BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect) == 0x000001, "Wrong size on BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_OnRep_EnableRuneAmbientEffect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BGA_Cube_Area_Effect.BGA_Cube_Area_Effect_C.OnRep_Printing
// 0x00D0 (0x00D0 - 0x0000)
struct BGA_Cube_Area_Effect_C_OnRep_Printing final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACUBE_C*                                K2Node_DynamicCast_AsCUBE;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BGA_Cube_Area_Effect_C_OnRep_Printing) == 0x000008, "Wrong alignment on BGA_Cube_Area_Effect_C_OnRep_Printing");
static_assert(sizeof(BGA_Cube_Area_Effect_C_OnRep_Printing) == 0x0000D0, "Wrong size on BGA_Cube_Area_Effect_C_OnRep_Printing");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_Printing, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BGA_Cube_Area_Effect_C_OnRep_Printing::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_Printing, K2Node_DynamicCast_AsCUBE) == 0x000008, "Member 'BGA_Cube_Area_Effect_C_OnRep_Printing::K2Node_DynamicCast_AsCUBE' has a wrong offset!");
static_assert(offsetof(BGA_Cube_Area_Effect_C_OnRep_Printing, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BGA_Cube_Area_Effect_C_OnRep_Printing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
