#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGlo_Node

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BluGlo_Node.BluGlo_Node_C
// 0x00D8 (0x0D08 - 0x0C30)
class ABluGlo_Node_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   bluLight;                                          // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleParticles;                                     // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bluglomesh;                                        // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Fort_BluGlo_loop_AudioComponent;                   // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  FortMiniMap;                                       // 0x0C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BluGloSpawnparticle;                               // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Trail_HorizontalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F; // 0x0C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Trail_VerticalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F; // 0x0C6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Trail__Direction_EEEFB2FD467DE31D5FDEDEA006F5C10F; // 0x0C70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x7];                                      // 0x0C71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Trail;                                             // 0x0C78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActivateEffects;                                   // 0x0C80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DeActivateEffects;                                 // 0x0C81(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          CanInteract;                                       // 0x0C82(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_C83[0x5];                                      // 0x0C83(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BluGloQuantity;                                    // 0x0C88(0x0018)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class AFortPawn*                              NewVar;                                            // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0CA8(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB4[0x4];                                      // 0x0CB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               TrailEffect;                                       // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_BluGloLoop;                                  // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RandomSpawnRotation;                               // 0x0CC8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD4[0x4];                                      // 0x0CD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABluGlow_MorphAnimation_C*              BlugloRef;                                         // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   PickupForceFeedback;                               // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               BlugloItemDef;                                     // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CollectText;                                       // 0x0CF0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BluGlo_Node(int32 EntryPoint);
	void ShowSpawnTrail(const struct FVector& StartLocation_0, float AnimDelay);
	void HandleMissionEvent_LocateBluGlo(const struct FGuid& InMissionGuid, const struct FGameplayTagContainer& ObjectiveHandle, class UFortMissionEventParams* Params_0, bool DO_NOT_USE_THIS_OR_VARIABLES_BELOW, class UObject* EventFocus, const class UDataAsset* EventContent, class AActor* EventInstigator, int32 GenericInt, float GenericFloat, const class FText& GenericText, const struct FGameplayTagContainer& GameplayTags, const struct FFortMissionEvent& MissionEvent);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn);
	void ReceiveBeginPlay();
	void Trail__UpdateFunc();
	void Trail__FinishedFunc();
	void UserConstructionScript();
	void OnRep_ActivateEffects();
	void OnRep_DeActivateEffects();
	void OnRep_CanInteract();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BluGlo_Node_C">();
	}
	static class ABluGlo_Node_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABluGlo_Node_C>();
	}
};
static_assert(alignof(ABluGlo_Node_C) == 0x000008, "Wrong alignment on ABluGlo_Node_C");
static_assert(sizeof(ABluGlo_Node_C) == 0x000D08, "Wrong size on ABluGlo_Node_C");
static_assert(offsetof(ABluGlo_Node_C, UberGraphFrame) == 0x000C30, "Member 'ABluGlo_Node_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, bluLight) == 0x000C38, "Member 'ABluGlo_Node_C::bluLight' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, IdleParticles) == 0x000C40, "Member 'ABluGlo_Node_C::IdleParticles' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, bluglomesh) == 0x000C48, "Member 'ABluGlo_Node_C::bluglomesh' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Fort_BluGlo_loop_AudioComponent) == 0x000C50, "Member 'ABluGlo_Node_C::Fort_BluGlo_loop_AudioComponent' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, FortMiniMap) == 0x000C58, "Member 'ABluGlo_Node_C::FortMiniMap' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, BluGloSpawnparticle) == 0x000C60, "Member 'ABluGlo_Node_C::BluGloSpawnparticle' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail_HorizontalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F) == 0x000C68, "Member 'ABluGlo_Node_C::Trail_HorizontalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail_VerticalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F) == 0x000C6C, "Member 'ABluGlo_Node_C::Trail_VerticalMovement_EEEFB2FD467DE31D5FDEDEA006F5C10F' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail__Direction_EEEFB2FD467DE31D5FDEDEA006F5C10F) == 0x000C70, "Member 'ABluGlo_Node_C::Trail__Direction_EEEFB2FD467DE31D5FDEDEA006F5C10F' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Trail) == 0x000C78, "Member 'ABluGlo_Node_C::Trail' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, ActivateEffects) == 0x000C80, "Member 'ABluGlo_Node_C::ActivateEffects' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, DeActivateEffects) == 0x000C81, "Member 'ABluGlo_Node_C::DeActivateEffects' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, CanInteract) == 0x000C82, "Member 'ABluGlo_Node_C::CanInteract' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, BluGloQuantity) == 0x000C88, "Member 'ABluGlo_Node_C::BluGloQuantity' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, NewVar) == 0x000CA0, "Member 'ABluGlo_Node_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, StartLocation) == 0x000CA8, "Member 'ABluGlo_Node_C::StartLocation' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, TrailEffect) == 0x000CB8, "Member 'ABluGlo_Node_C::TrailEffect' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, Sound_BluGloLoop) == 0x000CC0, "Member 'ABluGlo_Node_C::Sound_BluGloLoop' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, RandomSpawnRotation) == 0x000CC8, "Member 'ABluGlo_Node_C::RandomSpawnRotation' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, BlugloRef) == 0x000CD8, "Member 'ABluGlo_Node_C::BlugloRef' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, PickupForceFeedback) == 0x000CE0, "Member 'ABluGlo_Node_C::PickupForceFeedback' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, BlugloItemDef) == 0x000CE8, "Member 'ABluGlo_Node_C::BlugloItemDef' has a wrong offset!");
static_assert(offsetof(ABluGlo_Node_C, CollectText) == 0x000CF0, "Member 'ABluGlo_Node_C::CollectText' has a wrong offset!");

}

