#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Snow_Ambient_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Snow_Ambient_Lobby.BP_Snow_Ambient_Lobby_C
// 0x0018 (0x0348 - 0x0330)
class ABP_Snow_Ambient_Lobby_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Snow_Ambient_Lobby;                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Snow_Ambient_Lobby(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateGameSettings();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Snow_Ambient_Lobby_C">();
	}
	static class ABP_Snow_Ambient_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Snow_Ambient_Lobby_C>();
	}
};
static_assert(alignof(ABP_Snow_Ambient_Lobby_C) == 0x000008, "Wrong alignment on ABP_Snow_Ambient_Lobby_C");
static_assert(sizeof(ABP_Snow_Ambient_Lobby_C) == 0x000348, "Wrong size on ABP_Snow_Ambient_Lobby_C");
static_assert(offsetof(ABP_Snow_Ambient_Lobby_C, UberGraphFrame) == 0x000330, "Member 'ABP_Snow_Ambient_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Snow_Ambient_Lobby_C, P_Snow_Ambient_Lobby) == 0x000338, "Member 'ABP_Snow_Ambient_Lobby_C::P_Snow_Ambient_Lobby' has a wrong offset!");
static_assert(offsetof(ABP_Snow_Ambient_Lobby_C, DefaultSceneRoot) == 0x000340, "Member 'ABP_Snow_Ambient_Lobby_C::DefaultSceneRoot' has a wrong offset!");

}

