#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerOptionsTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeServerOptionsTile.CreativeServerOptionsTile_C
// 0x0120 (0x0C60 - 0x0B40)
class UCreativeServerOptionsTile_C final : public UFortCreativeServerOptionTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PrivacyToggle;                                     // 0x0B48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggle;                                       // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ViewPlayers;                                       // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0B60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USimpleCommonButtonWithInput_C*         Button_CloseFriends;                               // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleCommonButtonWithInput_C*         Button_ShowFriends;                                // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_NewServerContent;                     // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ServerDetails;                        // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CreateServerContent;                               // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CreateServerPrivacy;                               // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       EntryBox_ServerFriendList;                         // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_28;                                          // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_115;                                         // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorFill;                                   // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fill;                                        // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Gradient;                                    // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ServerImage;                                 // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               JoinServerContent;                                 // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LimitedAccessDateCalloutText;                      // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LimitedAccessServerContent;                        // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_JoinServerFriendCount;                    // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ServerTypeSwitcher;                                // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_JoinServerName;                               // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPrivacyToggle;                                 // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture*>                       TEMPBGArray;                                       // 0x0C28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         FriendListOutput;                                  // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          PlayersShown;                                      // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewServerIsPrivate;                                // 0x0C49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4A[0x2];                                      // 0x0C4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisabledColor;                                     // 0x0C4C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CreativeServerOptionsTile(int32 EntryPoint);
	void InitializeSelectedButton();
	void BP_OnDeselected();
	void BP_OnSelected();
	void BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void InputTypeChanged(bool bUsingGamepad);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetBPData(const class UFortCreativeServerInfo* ServerInfo);
	void BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void InitServerInfo(class UFortCreativeServerInfo* ServerInfo);
	void SetBGImage(int32 ArrayIdx);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeServerOptionsTile_C">();
	}
	static class UCreativeServerOptionsTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeServerOptionsTile_C>();
	}
};
static_assert(alignof(UCreativeServerOptionsTile_C) == 0x000008, "Wrong alignment on UCreativeServerOptionsTile_C");
static_assert(sizeof(UCreativeServerOptionsTile_C) == 0x000C60, "Wrong size on UCreativeServerOptionsTile_C");
static_assert(offsetof(UCreativeServerOptionsTile_C, UberGraphFrame) == 0x000B40, "Member 'UCreativeServerOptionsTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, PrivacyToggle) == 0x000B48, "Member 'UCreativeServerOptionsTile_C::PrivacyToggle' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, HoverToggle) == 0x000B50, "Member 'UCreativeServerOptionsTile_C::HoverToggle' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, ViewPlayers) == 0x000B58, "Member 'UCreativeServerOptionsTile_C::ViewPlayers' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Selected) == 0x000B60, "Member 'UCreativeServerOptionsTile_C::Selected' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Button_CloseFriends) == 0x000B68, "Member 'UCreativeServerOptionsTile_C::Button_CloseFriends' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Button_ShowFriends) == 0x000B70, "Member 'UCreativeServerOptionsTile_C::Button_ShowFriends' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CommonBorder_NewServerContent) == 0x000B78, "Member 'UCreativeServerOptionsTile_C::CommonBorder_NewServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CommonBorder_ServerDetails) == 0x000B80, "Member 'UCreativeServerOptionsTile_C::CommonBorder_ServerDetails' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CreateServerContent) == 0x000B88, "Member 'UCreativeServerOptionsTile_C::CreateServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CreateServerPrivacy) == 0x000B90, "Member 'UCreativeServerOptionsTile_C::CreateServerPrivacy' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, EntryBox_ServerFriendList) == 0x000B98, "Member 'UCreativeServerOptionsTile_C::EntryBox_ServerFriendList' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_28) == 0x000BA0, "Member 'UCreativeServerOptionsTile_C::Image_28' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_112) == 0x000BA8, "Member 'UCreativeServerOptionsTile_C::Image_112' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_113) == 0x000BB0, "Member 'UCreativeServerOptionsTile_C::Image_113' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_114) == 0x000BB8, "Member 'UCreativeServerOptionsTile_C::Image_114' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_115) == 0x000BC0, "Member 'UCreativeServerOptionsTile_C::Image_115' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_116) == 0x000BC8, "Member 'UCreativeServerOptionsTile_C::Image_116' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_ColorFill) == 0x000BD0, "Member 'UCreativeServerOptionsTile_C::Image_ColorFill' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_Fill) == 0x000BD8, "Member 'UCreativeServerOptionsTile_C::Image_Fill' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_Gradient) == 0x000BE0, "Member 'UCreativeServerOptionsTile_C::Image_Gradient' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_ServerImage) == 0x000BE8, "Member 'UCreativeServerOptionsTile_C::Image_ServerImage' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, JoinServerContent) == 0x000BF0, "Member 'UCreativeServerOptionsTile_C::JoinServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, LimitedAccessDateCalloutText) == 0x000BF8, "Member 'UCreativeServerOptionsTile_C::LimitedAccessDateCalloutText' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, LimitedAccessServerContent) == 0x000C00, "Member 'UCreativeServerOptionsTile_C::LimitedAccessServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, RichText_JoinServerFriendCount) == 0x000C08, "Member 'UCreativeServerOptionsTile_C::RichText_JoinServerFriendCount' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, ServerTypeSwitcher) == 0x000C10, "Member 'UCreativeServerOptionsTile_C::ServerTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Text_JoinServerName) == 0x000C18, "Member 'UCreativeServerOptionsTile_C::Text_JoinServerName' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, TextPrivacyToggle) == 0x000C20, "Member 'UCreativeServerOptionsTile_C::TextPrivacyToggle' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, TEMPBGArray) == 0x000C28, "Member 'UCreativeServerOptionsTile_C::TEMPBGArray' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, FriendListOutput) == 0x000C38, "Member 'UCreativeServerOptionsTile_C::FriendListOutput' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, PlayersShown) == 0x000C48, "Member 'UCreativeServerOptionsTile_C::PlayersShown' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, NewServerIsPrivate) == 0x000C49, "Member 'UCreativeServerOptionsTile_C::NewServerIsPrivate' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, DisabledColor) == 0x000C4C, "Member 'UCreativeServerOptionsTile_C::DisabledColor' has a wrong offset!");

}

