#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativePlayModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativePlayModal.CreativePlayModal_C
// 0x0060 (0x03C8 - 0x0368)
class UCreativePlayModal_C final : public UFortCreativePlayOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FriendsAdded;                                      // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      AddFriendsButton;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               AddFriendsContent;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AddFriendsText;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativeLobbyAdSpace_C*                CreativeLobbyAdSpace;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      IslandCodeButton;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IslandCodeContent;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StartIslandText;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CreativePlayModal(int32 EntryPoint);
	void CreativeIslandCodeConfirmedEvent(const class UFortCreativeIslandLink* IslandLink);
	void BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void InitFromObject(class UObject* InitObject);
	void InputTypeChanged(bool bUsingGamepad);
	void OnBeginOutro();
	void OnDeactivated();
	void OnActivated();
	void Construct();
	void BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature(class UFortCreativeServerInfo* ServerInfo);
	void NullActionHandler(bool* bPassThrough);
	void InitializeAddFriends();
	void HandleSocialImportClosed();
	void SetStartIsland(const class FText& StartIslandName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativePlayModal_C">();
	}
	static class UCreativePlayModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativePlayModal_C>();
	}
};
static_assert(alignof(UCreativePlayModal_C) == 0x000008, "Wrong alignment on UCreativePlayModal_C");
static_assert(sizeof(UCreativePlayModal_C) == 0x0003C8, "Wrong size on UCreativePlayModal_C");
static_assert(offsetof(UCreativePlayModal_C, UberGraphFrame) == 0x000368, "Member 'UCreativePlayModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, FriendsAdded) == 0x000370, "Member 'UCreativePlayModal_C::FriendsAdded' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, Intro) == 0x000378, "Member 'UCreativePlayModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, AddFriendsButton) == 0x000380, "Member 'UCreativePlayModal_C::AddFriendsButton' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, AddFriendsContent) == 0x000388, "Member 'UCreativePlayModal_C::AddFriendsContent' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, AddFriendsText) == 0x000390, "Member 'UCreativePlayModal_C::AddFriendsText' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, CreativeLobbyAdSpace) == 0x000398, "Member 'UCreativePlayModal_C::CreativeLobbyAdSpace' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, IslandCodeButton) == 0x0003A0, "Member 'UCreativePlayModal_C::IslandCodeButton' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, IslandCodeContent) == 0x0003A8, "Member 'UCreativePlayModal_C::IslandCodeContent' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, SafeZone_0) == 0x0003B0, "Member 'UCreativePlayModal_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, StartIslandText) == 0x0003B8, "Member 'UCreativePlayModal_C::StartIslandText' has a wrong offset!");
static_assert(offsetof(UCreativePlayModal_C, NewVar_0) == 0x0003C0, "Member 'UCreativePlayModal_C::NewVar_0' has a wrong offset!");

}

