#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeIslandLinkScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeIslandLinkScreen.CreativeIslandLinkScreen_C
// 0x00A0 (0x0480 - 0x03E0)
class UCreativeIslandLinkScreen_C final : public UFortCreativeIslandLinkScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loading;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IslandImage;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IslandListContent;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightningViolator_C*                   LightningViolator;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchmakingSpinner;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoIslandsContent;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Violator;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_IslandsList;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoIslands;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_WebURL;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ViolatorColor_Error;                               // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ViolatorColor_Success;                             // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_IslandPortal_C*                    Portal;                                            // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SelectPlotSound;                                   // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CreativeIslandLinkScreen(int32 EntryPoint);
	void BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnCreativeIslandLinkValidated(EFortCreativeIslandLinkValidationResult ValidateResult);
	void BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CommonActionWidget_0_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Destruct();
	void InitFromObject(class UObject* InitObject);
	void OnActivated();
	void OnAddedToActivationStack();
	void OnCreativeIslandLinksPopulated();
	void OnIslandLinkEntryTextChanged(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeIslandLinkScreen_C">();
	}
	static class UCreativeIslandLinkScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeIslandLinkScreen_C>();
	}
};
static_assert(alignof(UCreativeIslandLinkScreen_C) == 0x000008, "Wrong alignment on UCreativeIslandLinkScreen_C");
static_assert(sizeof(UCreativeIslandLinkScreen_C) == 0x000480, "Wrong size on UCreativeIslandLinkScreen_C");
static_assert(offsetof(UCreativeIslandLinkScreen_C, UberGraphFrame) == 0x0003E0, "Member 'UCreativeIslandLinkScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Loading) == 0x0003E8, "Member 'UCreativeIslandLinkScreen_C::Loading' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Image_2) == 0x0003F0, "Member 'UCreativeIslandLinkScreen_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Image_IslandImage) == 0x0003F8, "Member 'UCreativeIslandLinkScreen_C::Image_IslandImage' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Image_Shadow) == 0x000400, "Member 'UCreativeIslandLinkScreen_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, IslandListContent) == 0x000408, "Member 'UCreativeIslandLinkScreen_C::IslandListContent' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, LightningViolator) == 0x000410, "Member 'UCreativeIslandLinkScreen_C::LightningViolator' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, MatchmakingSpinner) == 0x000418, "Member 'UCreativeIslandLinkScreen_C::MatchmakingSpinner' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, NoIslandsContent) == 0x000420, "Member 'UCreativeIslandLinkScreen_C::NoIslandsContent' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Overlay_Violator) == 0x000428, "Member 'UCreativeIslandLinkScreen_C::Overlay_Violator' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, SafeZone_0) == 0x000430, "Member 'UCreativeIslandLinkScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Switcher_IslandsList) == 0x000438, "Member 'UCreativeIslandLinkScreen_C::Switcher_IslandsList' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Text_NoIslands) == 0x000440, "Member 'UCreativeIslandLinkScreen_C::Text_NoIslands' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Text_WebURL) == 0x000448, "Member 'UCreativeIslandLinkScreen_C::Text_WebURL' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, ViolatorColor_Error) == 0x000450, "Member 'UCreativeIslandLinkScreen_C::ViolatorColor_Error' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, ViolatorColor_Success) == 0x000460, "Member 'UCreativeIslandLinkScreen_C::ViolatorColor_Success' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, Portal) == 0x000470, "Member 'UCreativeIslandLinkScreen_C::Portal' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkScreen_C, SelectPlotSound) == 0x000478, "Member 'UCreativeIslandLinkScreen_C::SelectPlotSound' has a wrong offset!");

}

