#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeLobbyAd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeLobbyAd.CreativeLobbyAd_C
// 0x0020 (0x02C8 - 0x02A8)
class UCreativeLobbyAd_C final : public UFortCreativeAdTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_Description;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SubHeader;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CreativeLobbyAd(int32 EntryPoint);
	void OnCMSDataUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeLobbyAd_C">();
	}
	static class UCreativeLobbyAd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeLobbyAd_C>();
	}
};
static_assert(alignof(UCreativeLobbyAd_C) == 0x000008, "Wrong alignment on UCreativeLobbyAd_C");
static_assert(sizeof(UCreativeLobbyAd_C) == 0x0002C8, "Wrong size on UCreativeLobbyAd_C");
static_assert(offsetof(UCreativeLobbyAd_C, UberGraphFrame) == 0x0002A8, "Member 'UCreativeLobbyAd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Text_Description) == 0x0002B0, "Member 'UCreativeLobbyAd_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Text_Header) == 0x0002B8, "Member 'UCreativeLobbyAd_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Text_SubHeader) == 0x0002C0, "Member 'UCreativeLobbyAd_C::Text_SubHeader' has a wrong offset!");

}

