#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_Consumable_Passive

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Balloons_Consumable_Passive.GA_Athena_Balloons_Consumable_Passive_C
// 0x0178 (0x0AB0 - 0x0938)
class UGA_Athena_Balloons_Consumable_Passive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               EmoteTags;                                         // 0x0948(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CleanupTag;                                        // 0x0988(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DBNOTag;                                           // 0x0990(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BoogieBombedTag;                                   // 0x0998(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Ballon_ReleaseSingle_Sound;                        // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PlayerPawnMesh;                                    // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Balloon_ReleaseMultiple_Sound;                     // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingGameplayActor*>         Balloons;                                          // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         CurrentBalloonsInUse;                              // 0x09C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9CC[0x4];                                      // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Ballon_StartToRise_Sound;                          // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Ballon_Inflate_Sound;                              // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BalloonsNeededForFlight;                           // 0x09E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BalloonStencilRandom;                              // 0x09E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BalloonToSpawn;                                    // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationOffset;                                    // 0x09EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationOffset_0;                                  // 0x09F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationOffset_1;                                  // 0x0A04(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationOffset_2;                                  // 0x0A10(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1C[0x4];                                      // 0x0A1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 IntArray;                                          // 0x0A20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         BalloonColorRandom;                                // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackAttachSocket;                                  // 0x0A34(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3C[0x4];                                      // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Baloon_FloatingLoop_SoundComp;                     // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomMovement                           FortCustomMovementMode_Ballooning;                 // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A49[0x7];                                      // 0x0A49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Balloon_MaxAltitude_Sound;                         // 0x0A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PopAtMaxHeightTimer;                               // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5C[0x4];                                      // 0x0A5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PopAtMaxHeightFunctionName;                        // 0x0A60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundBase*                             Balloon_pop_sound;                                 // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RopeAttachSocketForBalloons;                       // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BladeWielderTag;                                   // 0x0A80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Balloon_MaxAltitude_Sound_2;                       // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Balloon_FloatingLoop_Sound_2;                      // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomMovement                           FortCustomMovementMode_Ziplining;                  // 0x0A98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A99[0x3];                                      // 0x0A99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BodyAttachSocketForBalloons;                       // 0x0A9C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA4[0x4];                                      // 0x0AA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_BalloonFloat;                                   // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Balloons_Consumable_Passive(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void PopAtMaxHeight();
	void AtMaxHeight(int32 RelationToCeiling);
	void MovementModeChangeFloat(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void EnteredVehicle(int32 SeatIndex);
	void ReleaseAllBalloons();
	void BalloonShot(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void BallooningMovementModeSwitch();
	void ReOrderBalloons();
	void SpawnBalloon();
	void ReleaseBalloon(bool ReleaseAll);
	void K2_ActivateAbility();
	void EventReceived_FC86BDF64A79027ED9EB28AEB1962691(const struct FGameplayEventData& Payload);
	void Added_B2E9B3DD40D3030992327A81C6119B2F();
	void EventReceived_133EAF3446D2EDB5A82D2FB0A6CB119A(const struct FGameplayEventData& Payload);
	void EventReceived_999DFDD44F82168D93090C90BD083650(const struct FGameplayEventData& Payload);
	void Added_84041178429377C08A0089A347587D99();
	void EventReceived_684C809A405BA666E6F4DCBBFAAC0C06(const struct FGameplayEventData& Payload);
	void Added_E961FDE641005079946282AB5DED997B();
	void OnActivate_3B5DF2164F2AB2AF9A05549DD939BBCD(class UGameplayAbility* ActivatedAbility);
	void OnRep_CurrentBalloonsInUse();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Balloons_Consumable_Passive_C">();
	}
	static class UGA_Athena_Balloons_Consumable_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Balloons_Consumable_Passive_C>();
	}
};
static_assert(alignof(UGA_Athena_Balloons_Consumable_Passive_C) == 0x000008, "Wrong alignment on UGA_Athena_Balloons_Consumable_Passive_C");
static_assert(sizeof(UGA_Athena_Balloons_Consumable_Passive_C) == 0x000AB0, "Wrong size on UGA_Athena_Balloons_Consumable_Passive_C");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, UberGraphFrame) == 0x000938, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, PlayerPawn) == 0x000940, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, EmoteTags) == 0x000948, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::EmoteTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, CleanupTag) == 0x000988, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::CleanupTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, DBNOTag) == 0x000990, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::DBNOTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BoogieBombedTag) == 0x000998, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BoogieBombedTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Ballon_ReleaseSingle_Sound) == 0x0009A0, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Ballon_ReleaseSingle_Sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, PlayerPawnMesh) == 0x0009A8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::PlayerPawnMesh' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Balloon_ReleaseMultiple_Sound) == 0x0009B0, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Balloon_ReleaseMultiple_Sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Balloons) == 0x0009B8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Balloons' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, CurrentBalloonsInUse) == 0x0009C8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::CurrentBalloonsInUse' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Ballon_StartToRise_Sound) == 0x0009D0, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Ballon_StartToRise_Sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Ballon_Inflate_Sound) == 0x0009D8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Ballon_Inflate_Sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BalloonsNeededForFlight) == 0x0009E0, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BalloonsNeededForFlight' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BalloonStencilRandom) == 0x0009E4, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BalloonStencilRandom' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BalloonToSpawn) == 0x0009E8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BalloonToSpawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, RotationOffset) == 0x0009EC, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::RotationOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, RotationOffset_0) == 0x0009F8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::RotationOffset_0' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, RotationOffset_1) == 0x000A04, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::RotationOffset_1' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, RotationOffset_2) == 0x000A10, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::RotationOffset_2' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, IntArray) == 0x000A20, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::IntArray' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BalloonColorRandom) == 0x000A30, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BalloonColorRandom' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BackAttachSocket) == 0x000A34, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BackAttachSocket' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Baloon_FloatingLoop_SoundComp) == 0x000A40, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Baloon_FloatingLoop_SoundComp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, FortCustomMovementMode_Ballooning) == 0x000A48, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::FortCustomMovementMode_Ballooning' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Balloon_MaxAltitude_Sound) == 0x000A50, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Balloon_MaxAltitude_Sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, PopAtMaxHeightTimer) == 0x000A58, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::PopAtMaxHeightTimer' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, PopAtMaxHeightFunctionName) == 0x000A60, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::PopAtMaxHeightFunctionName' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Balloon_pop_sound) == 0x000A70, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Balloon_pop_sound' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, RopeAttachSocketForBalloons) == 0x000A78, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::RopeAttachSocketForBalloons' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BladeWielderTag) == 0x000A80, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BladeWielderTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Balloon_MaxAltitude_Sound_2) == 0x000A88, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Balloon_MaxAltitude_Sound_2' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, Balloon_FloatingLoop_Sound_2) == 0x000A90, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::Balloon_FloatingLoop_Sound_2' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, FortCustomMovementMode_Ziplining) == 0x000A98, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::FortCustomMovementMode_Ziplining' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, BodyAttachSocketForBalloons) == 0x000A9C, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::BodyAttachSocketForBalloons' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_Passive_C, GE_BalloonFloat) == 0x000AA8, "Member 'UGA_Athena_Balloons_Consumable_Passive_C::GE_BalloonFloat' has a wrong offset!");

}

