#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_Consumable_AltFireRelease

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Balloons_Consumable_AltFireRelease.GA_Athena_Balloons_Consumable_AltFireRelease_C.ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0060(0x0020)()
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease) == 0x000008, "Wrong alignment on GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease");
static_assert(sizeof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease) == 0x0000A8, "Wrong size on GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, EntryPoint) == 0x000000, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000060, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000088, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000098, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, K2Node_DynamicCast_bSuccess1) == 0x0000A0, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, CallFunc_IsDBNO_ReturnValue) == 0x0000A1, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease, K2Node_Event_bWasCancelled) == 0x0000A2, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_ExecuteUbergraph_GA_Athena_Balloons_Consumable_AltFireRelease::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_Athena_Balloons_Consumable_AltFireRelease.GA_Athena_Balloons_Consumable_AltFireRelease_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Balloons_Consumable_AltFireRelease.GA_Athena_Balloons_Consumable_AltFireRelease_C.K2_CanActivateAbility
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          HasBalloons;                                       // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumActiveBalloons_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility) == 0x0000A0, "Wrong size on GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, HasBalloons) == 0x000061, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::HasBalloons' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000068, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, CallFunc_GetNumActiveBalloons_ReturnValue) == 0x000074, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::CallFunc_GetNumActiveBalloons_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, CallFunc_Conv_IntToString_ReturnValue) == 0x000078, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, CallFunc_Conv_BoolToString_ReturnValue) == 0x000088, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'GA_Athena_Balloons_Consumable_AltFireRelease_C_K2_CanActivateAbility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

