#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Throw_SneakySnowman

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_Athena_Grenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Throw_SneakySnowman.GA_Athena_Throw_SneakySnowman_C
// 0x0020 (0x0C58 - 0x0C38)
class UGA_Athena_Throw_SneakySnowman_C final : public UGA_Athena_Grenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_Throw_SneakySnowman_C;    // 0x0C38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           TrackSnowmenTag;                                   // 0x0C40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortProjectileBase*>            SnowmenActors;                                     // 0x0C48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_Throw_SneakySnowman(int32 EntryPoint);
	void K2_ActivateAbility();

	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Throw_SneakySnowman_C">();
	}
	static class UGA_Athena_Throw_SneakySnowman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Throw_SneakySnowman_C>();
	}
};
static_assert(alignof(UGA_Athena_Throw_SneakySnowman_C) == 0x000008, "Wrong alignment on UGA_Athena_Throw_SneakySnowman_C");
static_assert(sizeof(UGA_Athena_Throw_SneakySnowman_C) == 0x000C58, "Wrong size on UGA_Athena_Throw_SneakySnowman_C");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowman_C, UberGraphFrame_GA_Athena_Throw_SneakySnowman_C) == 0x000C38, "Member 'UGA_Athena_Throw_SneakySnowman_C::UberGraphFrame_GA_Athena_Throw_SneakySnowman_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowman_C, TrackSnowmenTag) == 0x000C40, "Member 'UGA_Athena_Throw_SneakySnowman_C::TrackSnowmenTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowman_C, SnowmenActors) == 0x000C48, "Member 'UGA_Athena_Throw_SneakySnowman_C::SnowmenActors' has a wrong offset!");

}

