#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_AltFireRelease

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Balloons_AltFireRelease.GA_Athena_Balloons_AltFireRelease_C
// 0x00A8 (0x09E0 - 0x0938)
class UGA_Athena_Balloons_AltFireRelease_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFortGameplayAbilityMontageInfo        AnimMontageInfo;                                   // 0x0940(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerDuration;                                   // 0x09A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    UseBushObjectiveStat;                              // 0x09A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAnimMontage*                           AnimMontage;                                       // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AirMontage;                                        // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           GroundMontage;                                     // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AirMontage_Female;                                 // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           GroundMontage_Female;                              // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Balloons_AltFireRelease(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Triggered_EF0D7C2A4633499E50EA929A49BF25DD(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_EF0D7C2A4633499E50EA929A49BF25DD(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_EF0D7C2A4633499E50EA929A49BF25DD(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Balloons_AltFireRelease_C">();
	}
	static class UGA_Athena_Balloons_AltFireRelease_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Balloons_AltFireRelease_C>();
	}
};
static_assert(alignof(UGA_Athena_Balloons_AltFireRelease_C) == 0x000008, "Wrong alignment on UGA_Athena_Balloons_AltFireRelease_C");
static_assert(sizeof(UGA_Athena_Balloons_AltFireRelease_C) == 0x0009E0, "Wrong size on UGA_Athena_Balloons_AltFireRelease_C");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, UberGraphFrame) == 0x000938, "Member 'UGA_Athena_Balloons_AltFireRelease_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, AnimMontageInfo) == 0x000940, "Member 'UGA_Athena_Balloons_AltFireRelease_C::AnimMontageInfo' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, PlayerPawn) == 0x000998, "Member 'UGA_Athena_Balloons_AltFireRelease_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, TriggerDuration) == 0x0009A0, "Member 'UGA_Athena_Balloons_AltFireRelease_C::TriggerDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, UseBushObjectiveStat) == 0x0009A8, "Member 'UGA_Athena_Balloons_AltFireRelease_C::UseBushObjectiveStat' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, AnimMontage) == 0x0009B8, "Member 'UGA_Athena_Balloons_AltFireRelease_C::AnimMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, AirMontage) == 0x0009C0, "Member 'UGA_Athena_Balloons_AltFireRelease_C::AirMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, GroundMontage) == 0x0009C8, "Member 'UGA_Athena_Balloons_AltFireRelease_C::GroundMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, AirMontage_Female) == 0x0009D0, "Member 'UGA_Athena_Balloons_AltFireRelease_C::AirMontage_Female' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_AltFireRelease_C, GroundMontage_Female) == 0x0009D8, "Member 'UGA_Athena_Balloons_AltFireRelease_C::GroundMontage_Female' has a wrong offset!");

}

