#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_C4

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_C4.GA_Athena_C4_C.ExecuteUbergraph_GA_Athena_C4
// 0x0340 (0x0340 - 0x0000)
struct GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable1;                             // 0x0010(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0090(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x00C8(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Direction;                      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0168(0x0040)(ContainsInstancedReference)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate5;             // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01C8(0x0020)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x01E8(0x00A8)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue1;            // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData1;                    // 0x02A8(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag1;                // 0x02C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue1;                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue2;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x02FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0308(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue3;                   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_326[0x2];                                      // 0x0326(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4) == 0x000010, "Wrong alignment on GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4");
static_assert(sizeof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4) == 0x000340, "Wrong size on GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, EntryPoint) == 0x000000, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, Temp_struct_Variable) == 0x000004, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, Temp_struct_Variable1) == 0x000010, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate1) == 0x000040, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate3) == 0x000060, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_GetObjectName_ReturnValue) == 0x000070, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_WaitDelay_ReturnValue) == 0x000080, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_K2_CommitAbility_ReturnValue) == 0x000088, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_TargetData) == 0x000090, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_ApplicationTag) == 0x0000B0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_TargetData2) == 0x0000C8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_ApplicationTag2) == 0x0000E8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000F0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsValid_ReturnValue1) == 0x0000F8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_Location) == 0x0000FC, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_Direction) == 0x000108, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_SpawnLocationAndRotation_OutLoc) == 0x000114, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_SpawnLocationAndRotation_OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_SpawnLocationAndRotation_OutRot) == 0x000120, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_SpawnLocationAndRotation_OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsStandalone_ReturnValue) == 0x000160, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_Event_bWasCancelled) == 0x000161, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_GetActorInfo_ReturnValue) == 0x000168, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate5) == 0x0001A8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001B8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001C8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_MakeStruct_GameplayEventData) == 0x0001E8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000290, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_HasAuthority_ReturnValue) == 0x0002A0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_Not_PreBool_ReturnValue) == 0x0002A1, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_BooleanOR_ReturnValue) == 0x0002A2, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_K2_CommitAbility_ReturnValue1) == 0x0002A3, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_K2_CommitAbility_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_TargetData1) == 0x0002A8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_TargetData1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CustomEvent_ApplicationTag1) == 0x0002C8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CustomEvent_ApplicationTag1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_WaitDelay_ReturnValue1) == 0x0002D0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_WaitDelay_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_WaitDelay_ReturnValue2) == 0x0002D8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_WaitDelay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsValid_ReturnValue2) == 0x0002E0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsValid_ReturnValue3) == 0x0002E1, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x0002E8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_DynamicCast_AsB_BGA_Athena_C4) == 0x0002F0, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_DynamicCast_AsB_BGA_Athena_C4' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_DynamicCast_bSuccess1) == 0x0002F8, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0002FC, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_K2_SetTimer_ReturnValue) == 0x000308, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsLocallyControlled_ReturnValue) == 0x000310, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_BooleanAND_ReturnValue) == 0x000311, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_WaitDelay_ReturnValue3) == 0x000318, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_WaitDelay_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000320, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000324, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, CallFunc_IsValid_ReturnValue4) == 0x000325, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4, K2Node_CreateDelegate_OutputDelegate6) == 0x000328, "Member 'GA_Athena_C4_C_ExecuteUbergraph_GA_Athena_C4::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_C4_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_C4_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_C4_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_C4_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_C4_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_C4_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_C4_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.Server_SpawnProjectile
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_C4_C_Server_SpawnProjectile final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Direction;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_C4_C_Server_SpawnProjectile) == 0x000004, "Wrong alignment on GA_Athena_C4_C_Server_SpawnProjectile");
static_assert(sizeof(GA_Athena_C4_C_Server_SpawnProjectile) == 0x000018, "Wrong size on GA_Athena_C4_C_Server_SpawnProjectile");
static_assert(offsetof(GA_Athena_C4_C_Server_SpawnProjectile, Location) == 0x000000, "Member 'GA_Athena_C4_C_Server_SpawnProjectile::Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_Server_SpawnProjectile, Direction) == 0x00000C, "Member 'GA_Athena_C4_C_Server_SpawnProjectile::Direction' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.Triggered_C84858EE4C8DF3AD547017AE92DD2D25
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25) == 0x000008, "Wrong alignment on GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25");
static_assert(sizeof(GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25) == 0x000028, "Wrong size on GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25");
static_assert(offsetof(GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25, TargetData) == 0x000000, "Member 'GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25, ApplicationTag) == 0x000020, "Member 'GA_Athena_C4_C_Triggered_C84858EE4C8DF3AD547017AE92DD2D25::ApplicationTag' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.Cancelled_C84858EE4C8DF3AD547017AE92DD2D25
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25) == 0x000008, "Wrong alignment on GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25");
static_assert(sizeof(GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25) == 0x000028, "Wrong size on GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25");
static_assert(offsetof(GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25, TargetData) == 0x000000, "Member 'GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25, ApplicationTag) == 0x000020, "Member 'GA_Athena_C4_C_Cancelled_C84858EE4C8DF3AD547017AE92DD2D25::ApplicationTag' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.Completed_C84858EE4C8DF3AD547017AE92DD2D25
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25) == 0x000008, "Wrong alignment on GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25");
static_assert(sizeof(GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25) == 0x000028, "Wrong size on GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25");
static_assert(offsetof(GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25, TargetData) == 0x000000, "Member 'GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25, ApplicationTag) == 0x000020, "Member 'GA_Athena_C4_C_Completed_C84858EE4C8DF3AD547017AE92DD2D25::ApplicationTag' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.UpdateTrajectorySpline
// 0x0068 (0x0068 - 0x0000)
struct GA_Athena_C4_C_UpdateTrajectorySpline final
{
public:
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySpline_OutSplinePoints; // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySpline_OutSplineTangents; // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Athena_C4_C_UpdateTrajectorySpline) == 0x000008, "Wrong alignment on GA_Athena_C4_C_UpdateTrajectorySpline");
static_assert(sizeof(GA_Athena_C4_C_UpdateTrajectorySpline) == 0x000068, "Wrong size on GA_Athena_C4_C_UpdateTrajectorySpline");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_SpawnLocationAndRotation_OutLoc) == 0x000004, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_SpawnLocationAndRotation_OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_SpawnLocationAndRotation_OutRot) == 0x000010, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_SpawnLocationAndRotation_OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00001C, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed) == 0x000034, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_FMax_ReturnValue) == 0x000044, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_CalculateProjectileTrajectorySpline_OutSplinePoints) == 0x000048, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_CalculateProjectileTrajectorySpline_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_UpdateTrajectorySpline, CallFunc_CalculateProjectileTrajectorySpline_OutSplineTangents) == 0x000058, "Member 'GA_Athena_C4_C_UpdateTrajectorySpline::CallFunc_CalculateProjectileTrajectorySpline_OutSplineTangents' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.SetupDummyProjectile
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Athena_C4_C_SetupDummyProjectile final
{
public:
	class USphereComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           CallFunc_GetComponentByClass_ReturnValue1;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledSphereRadius_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGravityZ_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue1;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActor*                 CallFunc_FinishSpawningActor_ReturnValue1;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_DynamicCast_AsBP_Projectile_Trajectory;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_C4_C_SetupDummyProjectile) == 0x000010, "Wrong alignment on GA_Athena_C4_C_SetupDummyProjectile");
static_assert(sizeof(GA_Athena_C4_C_SetupDummyProjectile) == 0x0000C0, "Wrong size on GA_Athena_C4_C_SetupDummyProjectile");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_GetComponentByClass_ReturnValue) == 0x000000, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_GetComponentByClass_ReturnValue1) == 0x000008, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_GetScaledSphereRadius_ReturnValue) == 0x000010, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_GetScaledSphereRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_GetGravityZ_ReturnValue) == 0x000014, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_GetGravityZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_GetTransform_ReturnValue1) == 0x000050, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_GetTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x000088, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_FinishSpawningActor_ReturnValue1) == 0x000098, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, K2Node_DynamicCast_AsBP_Projectile_Trajectory) == 0x0000A0, "Member 'GA_Athena_C4_C_SetupDummyProjectile::K2Node_DynamicCast_AsBP_Projectile_Trajectory' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'GA_Athena_C4_C_SetupDummyProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, K2Node_DynamicCast_AsB_BGA_Athena_C4) == 0x0000B0, "Member 'GA_Athena_C4_C_SetupDummyProjectile::K2Node_DynamicCast_AsB_BGA_Athena_C4' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, K2Node_DynamicCast_bSuccess1) == 0x0000B8, "Member 'GA_Athena_C4_C_SetupDummyProjectile::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SetupDummyProjectile, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000BC, "Member 'GA_Athena_C4_C_SetupDummyProjectile::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.SpawnLocationAndRotation
// 0x0090 (0x0090 - 0x0000)
struct GA_Athena_C4_C_SpawnLocationAndRotation final
{
public:
	struct FVector                                OutLoc;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRot;                                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_C4_C_SpawnLocationAndRotation) == 0x000004, "Wrong alignment on GA_Athena_C4_C_SpawnLocationAndRotation");
static_assert(sizeof(GA_Athena_C4_C_SpawnLocationAndRotation) == 0x000090, "Wrong size on GA_Athena_C4_C_SpawnLocationAndRotation");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, OutLoc) == 0x000000, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, OutRot) == 0x00000C, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, Temp_bool_Variable) == 0x000018, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00001C, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, K2Node_Select_Default) == 0x000034, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_RotateAngleAxis_ReturnValue) == 0x00004C, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000064, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Roll1) == 0x000070, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Pitch1) == 0x000074, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Yaw1) == 0x000078, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_FMin_ReturnValue) == 0x000080, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_SpawnLocationAndRotation, CallFunc_MakeRotator_ReturnValue) == 0x000084, "Member 'GA_Athena_C4_C_SpawnLocationAndRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function GA_Athena_C4.GA_Athena_C4_C.CalcGrenadeSpeedFromPitch
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_C4_C_CalcGrenadeSpeedFromPitch final
{
public:
	float                                         AimPitch;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrenadeSpeed;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_C4_C_CalcGrenadeSpeedFromPitch) == 0x000004, "Wrong alignment on GA_Athena_C4_C_CalcGrenadeSpeedFromPitch");
static_assert(sizeof(GA_Athena_C4_C_CalcGrenadeSpeedFromPitch) == 0x000020, "Wrong size on GA_Athena_C4_C_CalcGrenadeSpeedFromPitch");
static_assert(offsetof(GA_Athena_C4_C_CalcGrenadeSpeedFromPitch, AimPitch) == 0x000000, "Member 'GA_Athena_C4_C_CalcGrenadeSpeedFromPitch::AimPitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_CalcGrenadeSpeedFromPitch, GrenadeSpeed) == 0x000004, "Member 'GA_Athena_C4_C_CalcGrenadeSpeedFromPitch::GrenadeSpeed' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_C_CalcGrenadeSpeedFromPitch, CallFunc_NormalizeAxis_ReturnValue) == 0x000008, "Member 'GA_Athena_C4_C_CalcGrenadeSpeedFromPitch::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
