#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FireworksMortar_RocketTrajectory

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory
// 0x0160 (0x0160 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetScaledCapsuleSize_OutRadius;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutHalfHeight;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGravityZ_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0090(0x00A8)(ConstParm)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_ProjectileTrajectory_Athena_FireworksMortar_C* K2Node_DynamicCast_AsB_Projectile_Trajectory_Athena_Fireworks_Mortar; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory) == 0x000010, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory) == 0x000160, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, EntryPoint) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_GetScaledCapsuleSize_OutRadius) == 0x000014, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_GetScaledCapsuleSize_OutRadius' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_GetScaledCapsuleSize_OutHalfHeight) == 0x000018, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_GetScaledCapsuleSize_OutHalfHeight' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_FMax_ReturnValue) == 0x00001C, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_GetGravityZ_ReturnValue) == 0x000020, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_GetGravityZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_K2_SetTimer_ReturnValue) == 0x000028, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, K2Node_Event_bWasCancelled) == 0x000030, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000038, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_IsLocallyControlled_ReturnValue) == 0x000040, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_GetOwningPlayer_Player_Pawn1) == 0x000048, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_GetOwningPlayer_Player_Pawn1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, K2Node_Event_EventData) == 0x000090, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_WaitDelay_ReturnValue) == 0x000138, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, K2Node_DynamicCast_AsB_Projectile_Trajectory_Athena_Fireworks_Mortar) == 0x000148, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::K2Node_DynamicCast_AsB_Projectile_Trajectory_Athena_Fireworks_Mortar' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000151, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_ExecuteUbergraph_GA_Athena_FireworksMortar_RocketTrajectory::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.K2_ActivateAbilityFromEvent
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent) == 0x0000A8, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.SetupDummyProjectile
// 0x0070 (0x0070 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile final
{
public:
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileTrajectory*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_DynamicCast_AsBP_Projectile_Trajectory;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile) == 0x000010, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile) == 0x000070, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, CallFunc_IsValidClass_ReturnValue) == 0x000040, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, K2Node_DynamicCast_AsBP_Projectile_Trajectory) == 0x000058, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::K2Node_DynamicCast_AsBP_Projectile_Trajectory' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SetupDummyProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.UpdateTrajectorySpline
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline final
{
public:
	TArray<struct FVector>                        CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints; // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents; // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_GetProjectileTrajectoryPoints_OutHitResult; // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline) == 0x0000B0, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline, CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline::CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline, CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents) == 0x000010, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline::CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline, CallFunc_GetProjectileTrajectoryPoints_OutHitResult) == 0x000020, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline::CallFunc_GetProjectileTrajectoryPoints_OutHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_UpdateTrajectorySpline::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.SpawnTrajectoryIndicator
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator final
{
public:
	bool                                          bSpawnOnEquip;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileTrajectory*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator) == 0x000010, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator, bSpawnOnEquip) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator::bSpawnOnEquip' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator, ReturnValue) == 0x000008, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnTrajectoryIndicator::ReturnValue' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.SpawnLocationAndRotation
// 0x0090 (0x0090 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation final
{
public:
	struct FVector                                OutLoc;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRot;                                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation) == 0x000090, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, OutLoc) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, OutRot) == 0x00000C, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000018, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_GetOwningPlayer_Player_Pawn1) == 0x000020, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_GetOwningPlayer_Player_Pawn1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000034, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Roll1) == 0x00004C, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Pitch1) == 0x000050, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_BreakRotator_Yaw1) == 0x000054, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_RotateAngleAxis_ReturnValue) == 0x000064, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_FMin_ReturnValue) == 0x000080, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation, CallFunc_MakeRotator_ReturnValue) == 0x000084, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_SpawnLocationAndRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.CalcGrenadeSpeedFromPitch
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch final
{
public:
	float                                         AimPitch;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrenadeSpeed;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch) == 0x000004, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch) == 0x000028, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, AimPitch) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::AimPitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, GrenadeSpeed) == 0x000004, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::GrenadeSpeed' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_NormalizeAxis_ReturnValue) == 0x000008, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_GetValueAtLevel_ReturnValue) == 0x00000C, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x00001C, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_CalcGrenadeSpeedFromPitch::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.GetOwningPlayer
// 0x0060 (0x0060 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer final
{
public:
	class AFortPlayerPawn*                        Player_Pawn;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0010(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer) == 0x000060, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer, Player_Pawn) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer::Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer, CallFunc_GetActorInfo_ReturnValue) == 0x000010, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetOwningPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.GetProjectileTrajectoryActor
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor final
{
public:
	TSubclassOf<class AFortProjectileTrajectory>  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor) == 0x000008, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor, ReturnValue) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryActor::ReturnValue' has a wrong offset!");

// Function GA_Athena_FireworksMortar_RocketTrajectory.GA_Athena_FireworksMortar_RocketTrajectory_C.GetProjectileTrajectoryPoints
// 0x0158 (0x0158 - 0x0000)
struct GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints final
{
public:
	TArray<struct FVector>                        OutSplinePoints;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FVector>                        OutSplineTangents;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor)
	struct FHitResult                             OutHitResult;                                      // 0x0020(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed;   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySpline_OutSplinePoints; // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySpline_OutSplineTangents; // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints) == 0x000008, "Wrong alignment on GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints");
static_assert(sizeof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints) == 0x000158, "Wrong size on GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints, OutSplinePoints) == 0x000000, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints::OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints, OutSplineTangents) == 0x000010, "Member 'GA_Athena_FireworksMortar_RocketTrajectory_C_GetProjectileTrajectoryPoints::OutSplineTangents' has a wrong offset!");
