#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_ReleaseConditions

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Balloons_ReleaseConditions.GA_Athena_Balloons_ReleaseConditions_C
// 0x0068 (0x09A0 - 0x0938)
class UGA_Athena_Balloons_ReleaseConditions_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               EmoteTags;                                         // 0x0948(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CleanupTag;                                        // 0x0988(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DBNOTag;                                           // 0x0990(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BoogieBombedTag;                                   // 0x0998(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Balloons_ReleaseConditions(int32 EntryPoint);
	void Added_3041D97F469D592879CF7FBAB4B2FFFE();
	void Added_869B11E8460CEB542C30E0870B991702();
	void EventReceived_F1071C264D39527F08E6C2952068C28B(const struct FGameplayEventData& Payload);
	void K2_ActivateAbility();
	void OnActivate_1A489F684C338ABE95296EB4C5D51D1C(class UGameplayAbility* ActivatedAbility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Balloons_ReleaseConditions_C">();
	}
	static class UGA_Athena_Balloons_ReleaseConditions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Balloons_ReleaseConditions_C>();
	}
};
static_assert(alignof(UGA_Athena_Balloons_ReleaseConditions_C) == 0x000008, "Wrong alignment on UGA_Athena_Balloons_ReleaseConditions_C");
static_assert(sizeof(UGA_Athena_Balloons_ReleaseConditions_C) == 0x0009A0, "Wrong size on UGA_Athena_Balloons_ReleaseConditions_C");
static_assert(offsetof(UGA_Athena_Balloons_ReleaseConditions_C, UberGraphFrame) == 0x000938, "Member 'UGA_Athena_Balloons_ReleaseConditions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_ReleaseConditions_C, PlayerPawn) == 0x000940, "Member 'UGA_Athena_Balloons_ReleaseConditions_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_ReleaseConditions_C, EmoteTags) == 0x000948, "Member 'UGA_Athena_Balloons_ReleaseConditions_C::EmoteTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_ReleaseConditions_C, CleanupTag) == 0x000988, "Member 'UGA_Athena_Balloons_ReleaseConditions_C::CleanupTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_ReleaseConditions_C, DBNOTag) == 0x000990, "Member 'UGA_Athena_Balloons_ReleaseConditions_C::DBNOTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_ReleaseConditions_C, BoogieBombedTag) == 0x000998, "Member 'UGA_Athena_Balloons_ReleaseConditions_C::BoogieBombedTag' has a wrong offset!");

}

