#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Balloons_Consumable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Balloons_Consumable.GA_Athena_Balloons_Consumable_C
// 0x0020 (0x0958 - 0x0938)
class UGA_Athena_Balloons_Consumable_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AnimMontage;                                       // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BalloonCount;                                      // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Balloons_Consumable(int32 EntryPoint);
	void K2_ActivateAbility();
	void Triggered_99E3BAFE45A69278E8FDD9B6EB33BE53(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_99E3BAFE45A69278E8FDD9B6EB33BE53(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_99E3BAFE45A69278E8FDD9B6EB33BE53(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Balloons_Consumable_C">();
	}
	static class UGA_Athena_Balloons_Consumable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Balloons_Consumable_C>();
	}
};
static_assert(alignof(UGA_Athena_Balloons_Consumable_C) == 0x000008, "Wrong alignment on UGA_Athena_Balloons_Consumable_C");
static_assert(sizeof(UGA_Athena_Balloons_Consumable_C) == 0x000958, "Wrong size on UGA_Athena_Balloons_Consumable_C");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_C, UberGraphFrame) == 0x000938, "Member 'UGA_Athena_Balloons_Consumable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_C, PlayerPawn) == 0x000940, "Member 'UGA_Athena_Balloons_Consumable_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_C, AnimMontage) == 0x000948, "Member 'UGA_Athena_Balloons_Consumable_C::AnimMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Balloons_Consumable_C, BalloonCount) == 0x000950, "Member 'UGA_Athena_Balloons_Consumable_C::BalloonCount' has a wrong offset!");

}

