#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_Athena_SneakySnowman

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAT_TriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_Athena_SneakySnowman.GAT_Athena_SneakySnowman_C
// 0x0028 (0x0978 - 0x0950)
class UGAT_Athena_SneakySnowman_C final : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_Athena_SneakySnowman_C;         // 0x0950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0968(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAT_Athena_SneakySnowman(int32 EntryPoint);
	void K2_ActivateAbility();
	void Remove_Snowman(class AFortPlayerPawn* PlayerPawn_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_Athena_SneakySnowman_C">();
	}
	static class UGAT_Athena_SneakySnowman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_Athena_SneakySnowman_C>();
	}
};
static_assert(alignof(UGAT_Athena_SneakySnowman_C) == 0x000008, "Wrong alignment on UGAT_Athena_SneakySnowman_C");
static_assert(sizeof(UGAT_Athena_SneakySnowman_C) == 0x000978, "Wrong size on UGAT_Athena_SneakySnowman_C");
static_assert(offsetof(UGAT_Athena_SneakySnowman_C, UberGraphFrame_GAT_Athena_SneakySnowman_C) == 0x000950, "Member 'UGAT_Athena_SneakySnowman_C::UberGraphFrame_GAT_Athena_SneakySnowman_C' has a wrong offset!");
static_assert(offsetof(UGAT_Athena_SneakySnowman_C, PlayerPawn) == 0x000958, "Member 'UGAT_Athena_SneakySnowman_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_Athena_SneakySnowman_C, SnowmanItemDef) == 0x000960, "Member 'UGAT_Athena_SneakySnowman_C::SnowmanItemDef' has a wrong offset!");
static_assert(offsetof(UGAT_Athena_SneakySnowman_C, SnowmanItemInstances) == 0x000968, "Member 'UGAT_Athena_SneakySnowman_C::SnowmanItemInstances' has a wrong offset!");

}

