#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MenuScreen_Athena.MenuScreen_Athena_C.ExecuteUbergraph_MenuScreen_Athena
// 0x00A0 (0x00A0 - 0x0000)
struct MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsActive_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DontCrossArms_ReturnValue;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena) == 0x000008, "Wrong alignment on MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena");
static_assert(sizeof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena) == 0x0000A0, "Wrong size on MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, EntryPoint) == 0x000000, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_Montage_IsActive_ReturnValue) == 0x000004, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_Montage_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_GetCurveValue_ReturnValue) == 0x000008, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, K2Node_Event_DeltaTimeX) == 0x00000C, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_BreakRotator_Roll) == 0x000018, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_BreakRotator_Pitch) == 0x00001C, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_BreakRotator_Yaw) == 0x000020, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000038, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000044, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x000048, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_IsValid_ReturnValue1) == 0x000049, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_DontCrossArms_ReturnValue) == 0x00004A, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_DontCrossArms_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000050, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_GetSkeletalMeshForPartType_ReturnValue1) == 0x000058, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_GetSkeletalMeshForPartType_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_IsValid_ReturnValue2) == 0x000060, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_IsValid_ReturnValue3) == 0x000061, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_IsValid_ReturnValue4) == 0x000062, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_GetObjectName_ReturnValue) == 0x000068, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_Contains_ReturnValue) == 0x000078, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, Temp_bool_IsClosed_Variable) == 0x000079, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_GetCurveValue_ReturnValue1) == 0x00007C, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_GetCurveValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue) == 0x000088, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_IsValid_ReturnValue5) == 0x000090, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_Montage_Play_ReturnValue) == 0x000094, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_BooleanAND_ReturnValue1) == 0x000099, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function MenuScreen_Athena.MenuScreen_Athena_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MenuScreen_Athena_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuScreen_Athena_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MenuScreen_Athena_C_BlueprintUpdateAnimation");
static_assert(sizeof(MenuScreen_Athena_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MenuScreen_Athena_C_BlueprintUpdateAnimation");
static_assert(offsetof(MenuScreen_Athena_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MenuScreen_Athena_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

