#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "LiveLink_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MenuScreen_Athena.MenuScreen_Athena_C
// 0x0E18 (0x1118 - 0x0300)
class UMenuScreen_Athena_C final : public UFrontendAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_BC9F551249E266FA43BC349FC345F1FC; // 0x0308(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CFAAC90A46FD25342F35449196AB843E; // 0x0328(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2D7030A140A7B9E5EEB43E92FB2BC715; // 0x0348(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DB45EF5942BB99048E7C2C8416282A57; // 0x0368(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_38DE62F34079A9ED5E5B85BBCBAD2C22; // 0x03B0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_233187314408126920AC14A42BA98CE8; // 0x0460(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D368A9B74AE8F039DA6720801BDD62D5; // 0x04D8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_653C5A294667E7945D69729979692D20; // 0x0550(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DF33F517431A2AB6E430309E29277E98; // 0x05C8(0x0078)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6443F71D474774C8ECFB2A9F1ACC1D7A; // 0x0640(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_287AF5964C1BE390191EF89CB53D768D; // 0x06E0(0x00A0)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_3BACE47B4A5EF86B449B81BE7045ADA2; // 0x0780(0x00F8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_AE51F624415A5BC37D7F2FABCBE3FBE1; // 0x0878(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7340818D479943947A1DCCA16CFCAD54; // 0x0980(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B; // 0x09C8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E3A91A3649B6A1ABC9AC3B97A7AF4134; // 0x0A80(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93498E3D45EEA3CEA9E5EA88BB757C3B; // 0x0B38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F237E66D4F1546A501C2548E2EB67224; // 0x0B60(0x0028)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_FCD7422A4E3CE397C446C0A397266FEA; // 0x0B88(0x00F8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4C554C3D4E078CDC75B08E9CEF8DED1C; // 0x0C80(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_0A8F4F2D443AA18F68E37A8C2921091A; // 0x0D70(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_E5DB5C2C4C7A35E4ACBEDD9FA10C6F14; // 0x0E60(0x00F0)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_C178B0A941409C93F9B0D49EFE49B884; // 0x0F50(0x0038)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_E7A0FD13426A65CF5F44E4AF16FF9CE4; // 0x0F88(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DEF974814E7973E5101173AC4D7EB0D8; // 0x1050(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5416C1964D8376A710F7699A4BD7CB36; // 0x1098(0x0048)()
	UMulticastDelegateProperty_                   MenuScreenDispatcher;                              // 0x10E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasBeenSelected;                                   // 0x10F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F1[0x3];                                     // 0x10F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PoseInt;                                           // 0x10F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetTranslate;                                   // 0x10F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotate;                                      // 0x1104(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APlayerPawn_Athena_C*                   PawnOwner;                                         // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void MenuScreenDispatcher__DelegateSignature();
	void ExecuteUbergraph_MenuScreen_Athena(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_LeftB();
	void AnimNotify_playFacialAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B();
	void UserFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuScreen_Athena_C">();
	}
	static class UMenuScreen_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuScreen_Athena_C>();
	}
};
static_assert(alignof(UMenuScreen_Athena_C) == 0x000008, "Wrong alignment on UMenuScreen_Athena_C");
static_assert(sizeof(UMenuScreen_Athena_C) == 0x001118, "Wrong size on UMenuScreen_Athena_C");
static_assert(offsetof(UMenuScreen_Athena_C, UberGraphFrame) == 0x000300, "Member 'UMenuScreen_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ComponentToLocalSpace_BC9F551249E266FA43BC349FC345F1FC) == 0x000308, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ComponentToLocalSpace_BC9F551249E266FA43BC349FC345F1FC' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LocalToComponentSpace_CFAAC90A46FD25342F35449196AB843E) == 0x000328, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LocalToComponentSpace_CFAAC90A46FD25342F35449196AB843E' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Root_2D7030A140A7B9E5EEB43E92FB2BC715) == 0x000348, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Root_2D7030A140A7B9E5EEB43E92FB2BC715' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_DB45EF5942BB99048E7C2C8416282A57) == 0x000368, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_DB45EF5942BB99048E7C2C8416282A57' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByEnum_38DE62F34079A9ED5E5B85BBCBAD2C22) == 0x0003B0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByEnum_38DE62F34079A9ED5E5B85BBCBAD2C22' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_233187314408126920AC14A42BA98CE8) == 0x000460, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_233187314408126920AC14A42BA98CE8' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_D368A9B74AE8F039DA6720801BDD62D5) == 0x0004D8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_D368A9B74AE8F039DA6720801BDD62D5' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_653C5A294667E7945D69729979692D20) == 0x000550, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_653C5A294667E7945D69729979692D20' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_DF33F517431A2AB6E430309E29277E98) == 0x0005C8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_DF33F517431A2AB6E430309E29277E98' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByInt_6443F71D474774C8ECFB2A9F1ACC1D7A) == 0x000640, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByInt_6443F71D474774C8ECFB2A9F1ACC1D7A' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByInt_287AF5964C1BE390191EF89CB53D768D) == 0x0006E0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByInt_287AF5964C1BE390191EF89CB53D768D' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LegIK_3BACE47B4A5EF86B449B81BE7045ADA2) == 0x000780, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LegIK_3BACE47B4A5EF86B449B81BE7045ADA2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ModifyBone_AE51F624415A5BC37D7F2FABCBE3FBE1) == 0x000878, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ModifyBone_AE51F624415A5BC37D7F2FABCBE3FBE1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_7340818D479943947A1DCCA16CFCAD54) == 0x000980, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_7340818D479943947A1DCCA16CFCAD54' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B) == 0x0009C8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SaveCachedPose_E3A91A3649B6A1ABC9AC3B97A7AF4134) == 0x000A80, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SaveCachedPose_E3A91A3649B6A1ABC9AC3B97A7AF4134' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose_93498E3D45EEA3CEA9E5EA88BB757C3B) == 0x000B38, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose_93498E3D45EEA3CEA9E5EA88BB757C3B' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose_F237E66D4F1546A501C2548E2EB67224) == 0x000B60, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose_F237E66D4F1546A501C2548E2EB67224' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LegIK_FCD7422A4E3CE397C446C0A397266FEA) == 0x000B88, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LegIK_FCD7422A4E3CE397C446C0A397266FEA' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_4C554C3D4E078CDC75B08E9CEF8DED1C) == 0x000C80, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_4C554C3D4E078CDC75B08E9CEF8DED1C' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_0A8F4F2D443AA18F68E37A8C2921091A) == 0x000D70, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_0A8F4F2D443AA18F68E37A8C2921091A' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_E5DB5C2C4C7A35E4ACBEDD9FA10C6F14) == 0x000E60, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_E5DB5C2C4C7A35E4ACBEDD9FA10C6F14' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LiveLinkPose_C178B0A941409C93F9B0D49EFE49B884) == 0x000F50, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LiveLinkPose_C178B0A941409C93F9B0D49EFE49B884' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ApplyAdditive_E7A0FD13426A65CF5F44E4AF16FF9CE4) == 0x000F88, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ApplyAdditive_E7A0FD13426A65CF5F44E4AF16FF9CE4' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_DEF974814E7973E5101173AC4D7EB0D8) == 0x001050, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_DEF974814E7973E5101173AC4D7EB0D8' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_5416C1964D8376A710F7699A4BD7CB36) == 0x001098, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_5416C1964D8376A710F7699A4BD7CB36' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, MenuScreenDispatcher) == 0x0010E0, "Member 'UMenuScreen_Athena_C::MenuScreenDispatcher' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, HasBeenSelected) == 0x0010F0, "Member 'UMenuScreen_Athena_C::HasBeenSelected' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, PoseInt) == 0x0010F4, "Member 'UMenuScreen_Athena_C::PoseInt' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, OffsetTranslate) == 0x0010F8, "Member 'UMenuScreen_Athena_C::OffsetTranslate' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, OffsetRotate) == 0x001104, "Member 'UMenuScreen_Athena_C::OffsetRotate' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, PawnOwner) == 0x001110, "Member 'UMenuScreen_Athena_C::PawnOwner' has a wrong offset!");

}

