#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Golf_Cart_AnimBP_Dynamics

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Golf_Cart_AnimBP_Dynamics.SK_Golf_Cart_AnimBP_Dynamics_C
// 0x1780 (0x1A10 - 0x0290)
class USK_Golf_Cart_AnimBP_Dynamics_C final : public UFortVehicleDynAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_26B200B64E3BBD14ED71B49B956BFEB8; // 0x0298(0x0020)()
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_A8A72390494741E6F0777C913CE9EA7E; // 0x02C0(0x0550)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_53B066C943DD41BE1B0D65A839BA819D; // 0x0810(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_EC181E1341DD00E759B663A544946DE8; // 0x0830(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_BCCB4C3144E30EB9115D29826F133B14; // 0x0878(0x0020)()
	uint8                                         Pad_898[0x8];                                      // 0x0898(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7C184A89488FA6A164B6BC99EE4A3D4D; // 0x08A0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_DE966F04464F5491F1617CB701D1C9C7; // 0x0BB0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_B76D90B64CB1AEF2B4A6F1B0467616C6; // 0x0EC0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_CE982AED4F5D5F271AD8C883245EDDC7; // 0x11D0(0x0310)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D988F8A74E7C2AC3E6F9308F441F3BE4; // 0x14E0(0x0108)()
	uint8                                         Pad_15E8[0x8];                                     // 0x15E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A5F52AC64D61530A5EECBEB755A08519; // 0x15F0(0x0310)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3ADCB9E74C9017F35BB1578164FEE228; // 0x1900(0x0108)()

public:
	void ExecuteUbergraph_SK_Golf_Cart_AnimBP_Dynamics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Golf_Cart_AnimBP_Dynamics_C">();
	}
	static class USK_Golf_Cart_AnimBP_Dynamics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Golf_Cart_AnimBP_Dynamics_C>();
	}
};
static_assert(alignof(USK_Golf_Cart_AnimBP_Dynamics_C) == 0x000010, "Wrong alignment on USK_Golf_Cart_AnimBP_Dynamics_C");
static_assert(sizeof(USK_Golf_Cart_AnimBP_Dynamics_C) == 0x001A10, "Wrong size on USK_Golf_Cart_AnimBP_Dynamics_C");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, UberGraphFrame) == 0x000290, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_Root_26B200B64E3BBD14ED71B49B956BFEB8) == 0x000298, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_Root_26B200B64E3BBD14ED71B49B956BFEB8' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_RigidBody_A8A72390494741E6F0777C913CE9EA7E) == 0x0002C0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_RigidBody_A8A72390494741E6F0777C913CE9EA7E' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_ComponentToLocalSpace_53B066C943DD41BE1B0D65A839BA819D) == 0x000810, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_ComponentToLocalSpace_53B066C943DD41BE1B0D65A839BA819D' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_SubInput_EC181E1341DD00E759B663A544946DE8) == 0x000830, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_SubInput_EC181E1341DD00E759B663A544946DE8' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_LocalToComponentSpace_BCCB4C3144E30EB9115D29826F133B14) == 0x000878, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_LocalToComponentSpace_BCCB4C3144E30EB9115D29826F133B14' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_AnimDynamics_7C184A89488FA6A164B6BC99EE4A3D4D) == 0x0008A0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_AnimDynamics_7C184A89488FA6A164B6BC99EE4A3D4D' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_AnimDynamics_DE966F04464F5491F1617CB701D1C9C7) == 0x000BB0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_AnimDynamics_DE966F04464F5491F1617CB701D1C9C7' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_AnimDynamics_B76D90B64CB1AEF2B4A6F1B0467616C6) == 0x000EC0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_AnimDynamics_B76D90B64CB1AEF2B4A6F1B0467616C6' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_AnimDynamics_CE982AED4F5D5F271AD8C883245EDDC7) == 0x0011D0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_AnimDynamics_CE982AED4F5D5F271AD8C883245EDDC7' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_ModifyBone_D988F8A74E7C2AC3E6F9308F441F3BE4) == 0x0014E0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_ModifyBone_D988F8A74E7C2AC3E6F9308F441F3BE4' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_AnimDynamics_A5F52AC64D61530A5EECBEB755A08519) == 0x0015F0, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_AnimDynamics_A5F52AC64D61530A5EECBEB755A08519' has a wrong offset!");
static_assert(offsetof(USK_Golf_Cart_AnimBP_Dynamics_C, AnimGraphNode_ModifyBone_3ADCB9E74C9017F35BB1578164FEE228) == 0x001900, "Member 'USK_Golf_Cart_AnimBP_Dynamics_C::AnimGraphNode_ModifyBone_3ADCB9E74C9017F35BB1578164FEE228' has a wrong offset!");

}

