#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Player_Jump_Free_Direction_Pad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Floor_Player_Jump_Free_Direction_Pad.Trap_Floor_Player_Jump_Free_Direction_Pad_C
// 0x0058 (0x0E28 - 0x0DD0)
class ATrap_Floor_Player_Jump_Free_Direction_Pad_C final : public ABuildingTrapFloor_Launch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               JumpParticleSystem;                                // 0x0DD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0DE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x0DE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Placed_Sound;                                 // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Reload_Sound;                                 // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               JumpMaterial;                                      // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LaunchStrength;                                    // 0x0E20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LaunchPitch;                                       // 0x0E24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_Floor_Player_Jump_Free_Direction_Pad(int32 EntryPoint);
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ReloadBegin(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnFinishedBuilding();
	void OnPlaced();
	void OnReloadEnd();
	void UserConstructionScript();
	struct FVector GetImpulseDirection(class AActor* LaunchingActor);

	bool BP_ShouldTrigger(const TArray<class AActor*>& TouchingActors) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Floor_Player_Jump_Free_Direction_Pad_C">();
	}
	static class ATrap_Floor_Player_Jump_Free_Direction_Pad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Floor_Player_Jump_Free_Direction_Pad_C>();
	}
};
static_assert(alignof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C) == 0x000008, "Wrong alignment on ATrap_Floor_Player_Jump_Free_Direction_Pad_C");
static_assert(sizeof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C) == 0x000E28, "Wrong size on ATrap_Floor_Player_Jump_Free_Direction_Pad_C");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, UberGraphFrame) == 0x000DD0, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, JumpParticleSystem) == 0x000DD8, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::JumpParticleSystem' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Trigger) == 0x000DE0, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Scene1) == 0x000DE8, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Scene1' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Trap_Placed_Sound) == 0x000DF0, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Trap_Placed_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Trap_Active_Sound) == 0x000DF8, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Trap_Fire_Sound) == 0x000E00, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Trap_Reload_Sound) == 0x000E08, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Trap_Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, Trap_Explode_Sound) == 0x000E10, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, JumpMaterial) == 0x000E18, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::JumpMaterial' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, LaunchStrength) == 0x000E20, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::LaunchStrength' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_Player_Jump_Free_Direction_Pad_C, LaunchPitch) == 0x000E24, "Member 'ATrap_Floor_Player_Jump_Free_Direction_Pad_C::LaunchPitch' has a wrong offset!");

}

