#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_MountedTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Floor_MountedTurret.Trap_Floor_MountedTurret_C
// 0x0078 (0x0DF0 - 0x0D78)
class ATrap_Floor_MountedTurret_C final : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Center;                                            // 0x0D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMountedTurret_C*                       MountedTurret;                                     // 0x0DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTick;                                        // 0x0DB8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB9[0x7];                                      // 0x0DB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       AttachedFloor;                                     // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBumpPlayer_;                                 // 0x0DC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DC9[0x7];                                      // 0x0DC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ShouldBump_;                                       // 0x0DD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Trap_Floor_MountedTurret(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Turn_off_Tick(class ABuildingSMActor* BuildingSMActor);
	void DestroyedTurret(class AActor* DestroyedActor);
	void HideAttachedFloor();
	void BuildingDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnBuildingDeath();
	void SpawnTurret();
	void OnWorldReady();
	void OnFinishedBuilding();
	void OnPlaced();
	void UserConstructionScript();
	void BumpPlayerAndDestroyBuildings();
	void CalculateLaunch(class AActor* Player, struct FVector* Velocity);
	void OnModifyTrapIncomingDamage(float Damage, class AController* EventInstigator, class AActor* DamageCauser, float* OutDamage, bool* bOutConsumeEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Floor_MountedTurret_C">();
	}
	static class ATrap_Floor_MountedTurret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Floor_MountedTurret_C>();
	}
};
static_assert(alignof(ATrap_Floor_MountedTurret_C) == 0x000008, "Wrong alignment on ATrap_Floor_MountedTurret_C");
static_assert(sizeof(ATrap_Floor_MountedTurret_C) == 0x000DF0, "Wrong size on ATrap_Floor_MountedTurret_C");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, UberGraphFrame) == 0x000D78, "Member 'ATrap_Floor_MountedTurret_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, Center) == 0x000D80, "Member 'ATrap_Floor_MountedTurret_C::Center' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, Root) == 0x000D88, "Member 'ATrap_Floor_MountedTurret_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, Place_Trap_Sound) == 0x000D90, "Member 'ATrap_Floor_MountedTurret_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, Trap_Active_Sound) == 0x000D98, "Member 'ATrap_Floor_MountedTurret_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, Trap_Explode_Sound) == 0x000DA0, "Member 'ATrap_Floor_MountedTurret_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, Trap_Fire_Sound) == 0x000DA8, "Member 'ATrap_Floor_MountedTurret_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, MountedTurret) == 0x000DB0, "Member 'ATrap_Floor_MountedTurret_C::MountedTurret' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, ShouldTick) == 0x000DB8, "Member 'ATrap_Floor_MountedTurret_C::ShouldTick' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, AttachedFloor) == 0x000DC0, "Member 'ATrap_Floor_MountedTurret_C::AttachedFloor' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, ShouldBumpPlayer_) == 0x000DC8, "Member 'ATrap_Floor_MountedTurret_C::ShouldBumpPlayer_' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_MountedTurret_C, ShouldBump_) == 0x000DD0, "Member 'ATrap_Floor_MountedTurret_C::ShouldBump_' has a wrong offset!");

}

