#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Ceiling_BouncePad

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Ceiling_BouncePad.Trap_Ceiling_BouncePad_C
// 0x0190 (0x0F08 - 0x0D78)
class ATrap_Ceiling_BouncePad_C final : public ABuildingTrapCeiling
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BouncePadFX;                                       // 0x0D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0D98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Reload_Sound;                                      // 0x0DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Destroyed_Sound;                              // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OverlappedActor;                                   // 0x0DD0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerMinusDestructionRange;                       // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BouncePadTagMaxCount;                              // 0x0DDC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE4[0x4];                                      // 0x0DE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  LaunchedPlayer;                                    // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     LaunchedVehicle;                                   // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_LowGravity;                                     // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_BounceTracker1;                                 // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_BounceTracker2;                                 // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         VehicleVelocityMultiplier;                         // 0x0E10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleMinLateralVelocity;                         // 0x0E30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleMaxVelocity;                                // 0x0E50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerMaxLateralVelocity;                          // 0x0E70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerMaxDownwardVelocity;                         // 0x0E90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerMaxVelocity;                                 // 0x0EB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IgnoreFallDamage;                                  // 0x0ED0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED1[0x7];                                      // 0x0ED1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_LowGravityNoFX;                                 // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_LowGravityWithHopRocks;                         // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SetIgnoreFallDamage;                               // 0x0EE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Trap_Ceiling_BouncePad(int32 EntryPoint);
	void ReceiveDestroyed();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnFinishedBuilding();
	void OnPlaced();
	void UserConstructionScript();
	void VehicleLaunch(class AFortAthenaVehicle* Vehicle);
	void PlayerLaunch(class AFortPlayerPawnAthena* Player);
	void ApplyGameplayEffects();
	void OnRep_Overlappedactor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Ceiling_BouncePad_C">();
	}
	static class ATrap_Ceiling_BouncePad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Ceiling_BouncePad_C>();
	}
};
static_assert(alignof(ATrap_Ceiling_BouncePad_C) == 0x000008, "Wrong alignment on ATrap_Ceiling_BouncePad_C");
static_assert(sizeof(ATrap_Ceiling_BouncePad_C) == 0x000F08, "Wrong size on ATrap_Ceiling_BouncePad_C");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, UberGraphFrame) == 0x000D78, "Member 'ATrap_Ceiling_BouncePad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Arrow) == 0x000D80, "Member 'ATrap_Ceiling_BouncePad_C::Arrow' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, BouncePadFX) == 0x000D88, "Member 'ATrap_Ceiling_BouncePad_C::BouncePadFX' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trigger) == 0x000D90, "Member 'ATrap_Ceiling_BouncePad_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Root) == 0x000D98, "Member 'ATrap_Ceiling_BouncePad_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Active_Sound) == 0x000DA0, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Fire_Sound) == 0x000DA8, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Reload_Sound) == 0x000DB0, "Member 'ATrap_Ceiling_BouncePad_C::Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Explode_Sound) == 0x000DB8, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Place_Trap_Sound) == 0x000DC0, "Member 'ATrap_Ceiling_BouncePad_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Destroyed_Sound) == 0x000DC8, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Destroyed_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, OverlappedActor) == 0x000DD0, "Member 'ATrap_Ceiling_BouncePad_C::OverlappedActor' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMinusDestructionRange) == 0x000DD8, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMinusDestructionRange' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, BouncePadTagMaxCount) == 0x000DDC, "Member 'ATrap_Ceiling_BouncePad_C::BouncePadTagMaxCount' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, LaunchedPlayer) == 0x000DE8, "Member 'ATrap_Ceiling_BouncePad_C::LaunchedPlayer' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, LaunchedVehicle) == 0x000DF0, "Member 'ATrap_Ceiling_BouncePad_C::LaunchedVehicle' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_LowGravity) == 0x000DF8, "Member 'ATrap_Ceiling_BouncePad_C::GE_LowGravity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_BounceTracker1) == 0x000E00, "Member 'ATrap_Ceiling_BouncePad_C::GE_BounceTracker1' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_BounceTracker2) == 0x000E08, "Member 'ATrap_Ceiling_BouncePad_C::GE_BounceTracker2' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, VehicleVelocityMultiplier) == 0x000E10, "Member 'ATrap_Ceiling_BouncePad_C::VehicleVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, VehicleMinLateralVelocity) == 0x000E30, "Member 'ATrap_Ceiling_BouncePad_C::VehicleMinLateralVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, VehicleMaxVelocity) == 0x000E50, "Member 'ATrap_Ceiling_BouncePad_C::VehicleMaxVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMaxLateralVelocity) == 0x000E70, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMaxLateralVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMaxDownwardVelocity) == 0x000E90, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMaxDownwardVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMaxVelocity) == 0x000EB0, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMaxVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, IgnoreFallDamage) == 0x000ED0, "Member 'ATrap_Ceiling_BouncePad_C::IgnoreFallDamage' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_LowGravityNoFX) == 0x000ED8, "Member 'ATrap_Ceiling_BouncePad_C::GE_LowGravityNoFX' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_LowGravityWithHopRocks) == 0x000EE0, "Member 'ATrap_Ceiling_BouncePad_C::GE_LowGravityWithHopRocks' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, SetIgnoreFallDamage) == 0x000EE8, "Member 'ATrap_Ceiling_BouncePad_C::SetIgnoreFallDamage' has a wrong offset!");

}

